{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunt identifies hidden process executions on Linux systems. It detects processes executed from hidden files, which are often used by malicious actors to conceal their activities. By focusing on hidden files rather than directories, this hunt aims to catch stealthy processes while minimizing noise.\n","integration":["endpoint"],"uuid":"00461198-9a2d-4823-b4cc-f3d1b5c17935","name":"Hidden Process Execution","language":["ES|QL"],"license":"Elastic License v2","notes":["Included only hidden files, excluding hidden directories, as hidden directories are common in Unix.","Included a process or parent process count of <= 3, and a host count of <= 3 to eliminate common processes across different hosts."],"mitre":["T1036.004","T1059"],"query":["from logs-endpoint.events.process-*\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and \n  process.executable rlike \"/[^/]+/\\\\.[^/]+\"\n| stats cc = count(), host_count = count_distinct(host.name) by process.executable, process.parent.executable, user.id\n// Alter this threshold to make sense for your environment\n| where cc <= 3 and host_count <= 3\n| sort cc asc\n| limit 100\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-endpoint.events.process-*\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and \n  process.executable rlike \"/[^/]+/\\\\.[^/]+\"\n| stats cc = count(), host_count = count_distinct(host.name) by process.executable, process.parent.executable, user.id\n// Alter this threshold to make sense for your environment\n| where cc <= 3 and host_count <= 3\n| sort cc asc\n| limit 100\n"],"license":"Elastic License v2","description":"This hunt identifies hidden process executions on Linux systems. It detects processes executed from hidden files, which are often used by malicious actors to conceal their activities. By focusing on hidden files rather than directories, this hunt aims to catch stealthy processes while minimizing noise.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1036","name":"","reference":"https://attack.mitre.org/techniques/T1036/","subtechnique":[{"id":"T1036.004","reference":"https://attack.mitre.org/techniques/T1036/004/"}]},{"id":"T1059","name":"","reference":"https://attack.mitre.org/techniques/T1059/"}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["endpoint"]}}},"__N_SSG":true}