{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunt identifies programs started shortly after user logon and presence limited to a unique host. Run registry key and Startup folder cause programs to run each time that a user logs on and are often abused by malwares to maintain persistence on an endpoint.\n","integration":["endpoint"],"uuid":"52a958e8-0368-4e74-bd4b-a64faf397bf4","name":"Startup Execution with Low Occurrence Frequency by Unique Host","language":["ES|QL"],"license":"Elastic License v2","notes":["Items set to persist via Startup such as Run keys and Startup folder will be executed by `Explorer.exe` shortly after user logon (`process.Ext.session_info.relative_logon_time` helps us to capture that time difference).","Special attention to unknown hashes, suspicious paths and LOLBins should be given."],"mitre":["T1547","T1547.001"],"query":["from logs-endpoint.events.process-*\n| where host.os.family == \"windows\" and event.category == \"process\" and event.action == \"start\" and\n  /* programs started shortly after user logon like startup items */\n  process.parent.executable.caseless == \"c:\\\\windows\\\\explorer.exe\" and process.Ext.session_info.relative_logon_time <= 100 and\n  not starts_with(process.executable, \"C:\\\\Program Files\") and not starts_with(process.executable, \"C:\\\\Windows\\\\System32\\\\DriverStore\\\\FileRepository\\\\\") and\n  /* this hunt is scoped to unsigned or untrusted code-sig or Microsoft signed binaries to not miss lolbins */\n  (process.code_signature.exists == false or process.code_signature.trusted == false or starts_with(process.code_signature.subject_name, \"Microsoft\"))\n| keep process.executable, host.id, process.hash.sha256\n| eval process_path = replace(process.executable, \"\"\"([0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}|ns[a-z][A-Z0-9]{3,4}\\.tmp|DX[A-Z0-9]{3,4}\\.tmp|7z[A-Z0-9]{3,5}\\.tmp|[0-9\\.\\-\\_]{3,})\"\"\", \"\")\n| eval process_path = replace(process_path, \"\"\"[cC]:\\\\[uU][sS][eE][rR][sS]\\\\[a-zA-Z0-9\\.\\-\\_\\$~' ]+\\\\\"\"\", \"C:\\\\\\\\users\\\\\\\\user\\\\\\\\\")\n| stats hosts = count_distinct(host.id) by process_path, process.hash.sha256\n| where hosts == 1\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-endpoint.events.process-*\n| where host.os.family == \"windows\" and event.category == \"process\" and event.action == \"start\" and\n  /* programs started shortly after user logon like startup items */\n  process.parent.executable.caseless == \"c:\\\\windows\\\\explorer.exe\" and process.Ext.session_info.relative_logon_time <= 100 and\n  not starts_with(process.executable, \"C:\\\\Program Files\") and not starts_with(process.executable, \"C:\\\\Windows\\\\System32\\\\DriverStore\\\\FileRepository\\\\\") and\n  /* this hunt is scoped to unsigned or untrusted code-sig or Microsoft signed binaries to not miss lolbins */\n  (process.code_signature.exists == false or process.code_signature.trusted == false or starts_with(process.code_signature.subject_name, \"Microsoft\"))\n| keep process.executable, host.id, process.hash.sha256\n| eval process_path = replace(process.executable, \"\"\"([0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}|ns[a-z][A-Z0-9]{3,4}\\.tmp|DX[A-Z0-9]{3,4}\\.tmp|7z[A-Z0-9]{3,5}\\.tmp|[0-9\\.\\-\\_]{3,})\"\"\", \"\")\n| eval process_path = replace(process_path, \"\"\"[cC]:\\\\[uU][sS][eE][rR][sS]\\\\[a-zA-Z0-9\\.\\-\\_\\$~' ]+\\\\\"\"\", \"C:\\\\\\\\users\\\\\\\\user\\\\\\\\\")\n| stats hosts = count_distinct(host.id) by process_path, process.hash.sha256\n| where hosts == 1\n"],"license":"Elastic License v2","description":"This hunt identifies programs started shortly after user logon and presence limited to a unique host. Run registry key and Startup folder cause programs to run each time that a user logs on and are often abused by malwares to maintain persistence on an endpoint.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1547","name":"","reference":"https://attack.mitre.org/techniques/T1547/"},{"id":"T1547","name":"","reference":"https://attack.mitre.org/techniques/T1547/","subtechnique":[{"id":"T1547.001","reference":"https://attack.mitre.org/techniques/T1547/001/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["endpoint"]}}},"__N_SSG":true}