{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunt identifies potential SSH persistence mechanisms on Linux systems using OSQuery. It monitors SSH keys, authorized_keys files, SSH configuration files, and SSH file information to detect unauthorized access or persistence techniques. The hunt lists detailed information for further analysis and investigation.\n","integration":["endpoint"],"uuid":"aa759db0-4499-42f2-9f2f-be3e00fdebfa","name":"Persistence via SSH Configurations and/or Keys","language":["ES|QL","SQL"],"license":"Elastic License v2","notes":["Monitors SSH keys, authorized_keys files, and SSH configuration files using OSQuery to detect potential unauthorized access or persistence techniques.","Monitor for interactive processes by unusual users to detect potential unauthorized access or persistence techniques.","Lists detailed information about SSH files, including paths, owners, and permissions.","Requires additional data analysis and investigation into results to identify malicious or unauthorized SSH configurations and keys."],"mitre":["T1098.004","T1563.001"],"query":["SELECT * FROM user_ssh_keys\n","SELECT authorized_keys.*\nFROM users\nJOIN authorized_keys\nUSING(uid)\n","SELECT * FROM ssh_configs\n","SELECT\n    f.filename,\n    f.path,\n    u.username AS file_owner,\n    g.groupname AS group_owner,\n    datetime(f.atime, 'unixepoch') AS file_last_access_time,\n    datetime(f.mtime, 'unixepoch') AS file_last_modified_time,\n    datetime(f.ctime, 'unixepoch') AS file_last_status_change_time,\n    datetime(f.btime, 'unixepoch') AS file_created_time,\n    f.size AS size_bytes\nFROM\n    file f\nLEFT JOIN\n    users u ON f.uid = u.uid\nLEFT JOIN\n    groups g ON f.gid = g.gid\nWHERE\n    f.path LIKE \"/root/.ssh/%\"\n    OR f.path LIKE \"/home/%/.ssh/%\"\n    OR f.path LIKE \"/etc/ssh/%\"\n    OR f.path LIKE \"/etc/ssh/sshd_config.d/%\"\n    OR f.path LIKE \"/usr/sbin/.ssh/%\"\n    OR f.path LIKE \"/bin/.ssh/%\"\n    OR f.path LIKE \"/usr/games/.ssh/%\"\n    OR f.path LIKE \"/var/cache/man/.ssh/%\"\n    OR f.path LIKE \"/var/mail/.ssh/%\"\n    OR f.path LIKE \"/var/spool/news/.ssh/%\"\n    OR f.path LIKE \"/var/spool/lpd/.ssh/%\"\n    OR f.path LIKE \"/var/backups/.ssh/%\"\n    OR f.path LIKE \"/var/list/.ssh/%\"\n    OR f.path LIKE \"/run/ircd/.ssh/%\"\n    OR f.path LIKE \"/var/lib/gnats/.ssh/%\"\n    OR f.path LIKE \"/nonexistent/.ssh/%\"\n    OR f.path LIKE \"/run/systemd/.ssh/%\"\n    OR f.path LIKE \"/var/cache/pollinate/.ssh/%\"\n    OR f.path LIKE \"/run/sshd/.ssh/%\"\n    OR f.path LIKE \"/home/syslog/.ssh/%\"\n    OR f.path LIKE \"/run/uuidd/.ssh/%\"\n    OR f.path LIKE \"/var/lib/tpm/.ssh/%\"\n    OR f.path LIKE \"/var/lib/landscape/.ssh/%\"\n    OR f.path LIKE \"/var/lib/usbmux/.ssh/%\"\n    OR f.path LIKE \"/var/snap/lxd/common/lxd/.ssh/%\";\n","from logs-endpoint.events.process-*\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and process.interactive == \"true\"\n| stats cc = count(), host_count = count_distinct(host.name) by user.name\n// Alter this threshold to make sense for your environment\n| where cc <= 50 and host_count <= 3\n| sort cc asc\n| limit 100\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["SELECT * FROM user_ssh_keys\n","SELECT authorized_keys.*\nFROM users\nJOIN authorized_keys\nUSING(uid)\n","SELECT * FROM ssh_configs\n","SELECT\n    f.filename,\n    f.path,\n    u.username AS file_owner,\n    g.groupname AS group_owner,\n    datetime(f.atime, 'unixepoch') AS file_last_access_time,\n    datetime(f.mtime, 'unixepoch') AS file_last_modified_time,\n    datetime(f.ctime, 'unixepoch') AS file_last_status_change_time,\n    datetime(f.btime, 'unixepoch') AS file_created_time,\n    f.size AS size_bytes\nFROM\n    file f\nLEFT JOIN\n    users u ON f.uid = u.uid\nLEFT JOIN\n    groups g ON f.gid = g.gid\nWHERE\n    f.path LIKE \"/root/.ssh/%\"\n    OR f.path LIKE \"/home/%/.ssh/%\"\n    OR f.path LIKE \"/etc/ssh/%\"\n    OR f.path LIKE \"/etc/ssh/sshd_config.d/%\"\n    OR f.path LIKE \"/usr/sbin/.ssh/%\"\n    OR f.path LIKE \"/bin/.ssh/%\"\n    OR f.path LIKE \"/usr/games/.ssh/%\"\n    OR f.path LIKE \"/var/cache/man/.ssh/%\"\n    OR f.path LIKE \"/var/mail/.ssh/%\"\n    OR f.path LIKE \"/var/spool/news/.ssh/%\"\n    OR f.path LIKE \"/var/spool/lpd/.ssh/%\"\n    OR f.path LIKE \"/var/backups/.ssh/%\"\n    OR f.path LIKE \"/var/list/.ssh/%\"\n    OR f.path LIKE \"/run/ircd/.ssh/%\"\n    OR f.path LIKE \"/var/lib/gnats/.ssh/%\"\n    OR f.path LIKE \"/nonexistent/.ssh/%\"\n    OR f.path LIKE \"/run/systemd/.ssh/%\"\n    OR f.path LIKE \"/var/cache/pollinate/.ssh/%\"\n    OR f.path LIKE \"/run/sshd/.ssh/%\"\n    OR f.path LIKE \"/home/syslog/.ssh/%\"\n    OR f.path LIKE \"/run/uuidd/.ssh/%\"\n    OR f.path LIKE \"/var/lib/tpm/.ssh/%\"\n    OR f.path LIKE \"/var/lib/landscape/.ssh/%\"\n    OR f.path LIKE \"/var/lib/usbmux/.ssh/%\"\n    OR f.path LIKE \"/var/snap/lxd/common/lxd/.ssh/%\";\n","from logs-endpoint.events.process-*\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and process.interactive == \"true\"\n| stats cc = count(), host_count = count_distinct(host.name) by user.name\n// Alter this threshold to make sense for your environment\n| where cc <= 50 and host_count <= 3\n| sort cc asc\n| limit 100\n"],"license":"Elastic License v2","description":"This hunt identifies potential SSH persistence mechanisms on Linux systems using OSQuery. It monitors SSH keys, authorized_keys files, SSH configuration files, and SSH file information to detect unauthorized access or persistence techniques. The hunt lists detailed information for further analysis and investigation.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1098","name":"","reference":"https://attack.mitre.org/techniques/T1098/","subtechnique":[{"id":"T1098.004","reference":"https://attack.mitre.org/techniques/T1098/004/"}]},{"id":"T1563","name":"","reference":"https://attack.mitre.org/techniques/T1563/","subtechnique":[{"id":"T1563.001","reference":"https://attack.mitre.org/techniques/T1563/001/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["endpoint"]}}},"__N_SSG":true}