{"pageProps":{"rule":{"metadata":{"creation_date":"2023/01/15","integration":["google_workspace"],"maturity":"production","promotion":true,"updated_date":"2025/01/15"},"rule":{"author":["Elastic"],"description":"Identifies the occurrence of a security alert from the Google Workspace alerts center. Google Workspace's security alert\ncenter provides an overview of actionable alerts that may be affecting an organization's domain. An alert is a warning\nof a potential security issue that Google has detected.\n","false_positives":["    To tune this rule, add exceptions to exclude any google_workspace.alert.type which should not trigger this rule.\n    ","For additional tuning, severity exceptions for google_workspace.alert.metadata.severity can be added."],"from":"now-130m","index":["filebeat-*","logs-google_workspace*"],"interval":"10m","language":"kuery","license":"Elastic License v2","name":"Forwarded Google Workspace Security Alert","note":"## Setup\n\n## Triage and analysis\n\nThis is a promotion rule for Google Workspace security events, which are alertable events per the vendor.\nConsult vendor documentation on interpreting specific events.\n","references":["https://workspace.google.com/products/admin/alert-center/","https://www.elastic.co/security-labs/google-workspace-attack-surface-part-one","https://www.elastic.co/security-labs/google-workspace-attack-surface-part-two"],"risk_score":73,"rule_id":"f1a6d0f4-95b8-11ed-9517-f661ea17fbcc","rule_name_override":"google_workspace.alert.type","severity":"high","tags":["Domain: Cloud","Data Source: Google Workspace","Use Case: Log Auditing","Use Case: Threat Detection","Resources: Investigation Guide","Language: kuery"],"timestamp_override":"event.ingested","type":"query","query":"event.dataset: google_workspace.alert\n","severity_mapping":[{"field":"google_workspace.alert.metadata.severity","operator":"equals","severity":"low","value":"LOW"},{"field":"google_workspace.alert.metadata.severity","operator":"equals","severity":"medium","value":"MEDIUM"},{"field":"google_workspace.alert.metadata.severity","operator":"equals","severity":"high","value":"HIGH"}]}}},"__N_SSG":true}