{"pageProps":{"rule":{"metadata":{"creation_date":"2021/03/22","integration":["endpoint"],"maturity":"production","updated_date":"2024/08/07"},"rule":{"author":["Elastic"],"description":"Identifies NullSessionPipe registry modifications that specify which pipes can be accessed anonymously. This could be\nindicative of adversary lateral movement preparation by making the added pipe available to everyone.\n","from":"now-9m","index":["logs-endpoint.events.registry-*","endgame-*","logs-windows.sysmon_operational-*","winlogbeat-*"],"language":"eql","license":"Elastic License v2","name":"NullSessionPipe Registry Modification","references":["https://www.welivesecurity.com/2019/05/29/turla-powershell-usage/","https://docs.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/network-access-restrict-anonymous-access-to-named-pipes-and-shares"],"risk_score":47,"rule_id":"ddab1f5f-7089-44f5-9fda-de5b11322e77","severity":"medium","tags":["Domain: Endpoint","OS: Windows","Use Case: Threat Detection","Tactic: Lateral Movement","Tactic: Defense Evasion","Data Source: Elastic Endgame","Data Source: Elastic Defend","Data Source: Sysmon"],"timestamp_override":"event.ingested","type":"eql","query":"registry where host.os.type == \"windows\" and event.type == \"change\" and\nregistry.path : (\n    \"HKLM\\\\SYSTEM\\\\*ControlSet*\\\\services\\\\LanmanServer\\\\Parameters\\\\NullSessionPipes\",\n    \"\\\\REGISTRY\\\\MACHINE\\\\SYSTEM\\\\*ControlSet*\\\\services\\\\LanmanServer\\\\Parameters\\\\NullSessionPipes\"\n) and length(registry.data.strings) > 0 and\nnot registry.data.strings : \"(empty)\"\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1021","name":"Remote Services","reference":"https://attack.mitre.org/techniques/T1021/","subtechnique":[{"id":"T1021.002","name":"SMB/Windows Admin Shares","reference":"https://attack.mitre.org/techniques/T1021/002/"}]}],"tactic":{"id":"TA0008","name":"Lateral Movement","reference":"https://attack.mitre.org/tactics/TA0008/"}},{"framework":"MITRE ATT&CK","technique":[{"id":"T1112","name":"Modify Registry","reference":"https://attack.mitre.org/techniques/T1112/"}],"tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"}}]}}},"__N_SSG":true}