{"pageProps":{"rule":{"metadata":{"creation_date":"2020/11/23","integration":["endpoint"],"maturity":"production","updated_date":"2024/05/21"},"rule":{"author":["Elastic"],"description":"Identifies the creation of a suspicious ImagePath value. This could be an indication of an adversary attempting to\nstealthily persist or escalate privileges through abnormal service creation.\n","from":"now-9m","index":["logs-endpoint.events.registry-*","endgame-*","logs-windows.sysmon_operational-*"],"language":"eql","license":"Elastic License v2","name":"Suspicious ImagePath Service Creation","risk_score":73,"rule_id":"36a8e048-d888-4f61-a8b9-0f9e2e40f317","severity":"high","tags":["Domain: Endpoint","OS: Windows","Use Case: Threat Detection","Tactic: Persistence","Tactic: Defense Evasion","Data Source: Elastic Endgame","Data Source: Elastic Defend","Data Source: Sysmon"],"timestamp_override":"event.ingested","type":"eql","query":"registry where host.os.type == \"windows\" and registry.path : (\n    \"HKLM\\\\SYSTEM\\\\ControlSet*\\\\Services\\\\*\\\\ImagePath\",\n    \"\\\\REGISTRY\\\\MACHINE\\\\SYSTEM\\\\ControlSet*\\\\Services\\\\*\\\\ImagePath\"\n    ) and\n /* add suspicious registry ImagePath values here */\n    registry.data.strings : (\"%COMSPEC%*\", \"*\\\\.\\\\pipe\\\\*\")\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1543","name":"Create or Modify System Process","reference":"https://attack.mitre.org/techniques/T1543/","subtechnique":[{"id":"T1543.003","name":"Windows Service","reference":"https://attack.mitre.org/techniques/T1543/003/"}]}],"tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"}},{"framework":"MITRE ATT&CK","technique":[{"id":"T1112","name":"Modify Registry","reference":"https://attack.mitre.org/techniques/T1112/"}],"tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"}}]}}},"__N_SSG":true}