{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunting query identifies when a public client app successfully retrieves an OAuth access token using client credentials from multiple client addresses. For public client applications in Okta that leverage OAuth, client credentials can be used to retrieve access tokens without user consent. Unsecured credentials may be compromised by an adversary who may use them to request an access token on behalf of the public client app.\n","integration":["okta"],"uuid":"38d82c2c-71d9-11ef-a9be-f661ea17fbcc","name":"OAuth Access Token Granted for Public Client App from Multiple Client Addresses","language":["ES|QL"],"license":"Elastic License v2","notes":["Review `okta.debug_context.debug_data.flattened.grantType` to identify if the grant type is `client_credentials`","Ignore `okta.debug_context.debug_data.flattened.requestedScopes` values that indicate read-only access","Review `okta.actor.display_name` to identify the public client app that attempted to retrieve the access token. This may help identify the compromised client credentials.","Filter on the public client app and aggregate by `event.action` to determine what actions were taken by the public client app after the access token was granted."],"mitre":["T1550.001"],"query":["from logs-okta.system*\n| where @timestamp > NOW() - 21 day\n\n// truncate the timestamp to 1 day\n| eval target_time_window = DATE_TRUNC(1 days, @timestamp)\n| where\n\n    // filter for successful OAuth access token grant requests\n    event.action == \"app.oauth2.as.token.grant.access_token\"\n    and event.outcome == \"success\"\n    and event.dataset == \"okta.system\"\n\n    // filter for public client apps\n    and okta.actor.type == \"PublicClientApp\"\n\n    // ignore Elastic Okta integration and DataDog actors\n    and not (okta.actor.display_name LIKE \"Okta*\" or okta.actor.display_name LIKE \"Datadog*\")\n\n// count the number of access tokens granted by the same public client app in a day\n| stats token_granted_count = count(*), unique_client_ip = count_distinct(okta.client.ip) by target_time_window, okta.actor.display_name\n\n// filter where access tokens were granted on the same day but client addresses are different\n| where unique_client_ip >= 2 and token_granted_count >= 2\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-okta.system*\n| where @timestamp > NOW() - 21 day\n\n// truncate the timestamp to 1 day\n| eval target_time_window = DATE_TRUNC(1 days, @timestamp)\n| where\n\n    // filter for successful OAuth access token grant requests\n    event.action == \"app.oauth2.as.token.grant.access_token\"\n    and event.outcome == \"success\"\n    and event.dataset == \"okta.system\"\n\n    // filter for public client apps\n    and okta.actor.type == \"PublicClientApp\"\n\n    // ignore Elastic Okta integration and DataDog actors\n    and not (okta.actor.display_name LIKE \"Okta*\" or okta.actor.display_name LIKE \"Datadog*\")\n\n// count the number of access tokens granted by the same public client app in a day\n| stats token_granted_count = count(*), unique_client_ip = count_distinct(okta.client.ip) by target_time_window, okta.actor.display_name\n\n// filter where access tokens were granted on the same day but client addresses are different\n| where unique_client_ip >= 2 and token_granted_count >= 2\n"],"license":"Elastic License v2","description":"This hunting query identifies when a public client app successfully retrieves an OAuth access token using client credentials from multiple client addresses. For public client applications in Okta that leverage OAuth, client credentials can be used to retrieve access tokens without user consent. Unsecured credentials may be compromised by an adversary who may use them to request an access token on behalf of the public client app.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1550","name":"","reference":"https://attack.mitre.org/techniques/T1550/","subtechnique":[{"id":"T1550.001","reference":"https://attack.mitre.org/techniques/T1550/001/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["okta"]}}},"__N_SSG":true}