{"pageProps":{"rule":{"metadata":{"creation_date":"2020/11/02","integration":["endpoint","windows","system","m365_defender","sentinel_one_cloud_funnel"],"maturity":"production","updated_date":"2024/10/15","min_stack_version":"8.14.0","min_stack_comments":"Breaking change at 8.14.0 for the Windows Integration."},"rule":{"author":["Elastic"],"description":"Identifies the use of net.exe to mount a WebDav or hidden remote share. This may indicate lateral movement or\npreparation for data exfiltration.\n","from":"now-9m","index":["logs-endpoint.events.process-*","winlogbeat-*","logs-windows.forwarded*","logs-windows.sysmon_operational-*","endgame-*","logs-system.security*","logs-m365_defender.event-*","logs-sentinel_one_cloud_funnel.*"],"language":"eql","license":"Elastic License v2","name":"Mounting Hidden or WebDav Remote Shares","risk_score":47,"rule_id":"c4210e1c-64f2-4f48-b67e-b5a8ffe3aa14","severity":"medium","tags":["Domain: Endpoint","OS: Windows","Use Case: Threat Detection","Tactic: Initial Access","Tactic: Lateral Movement","Data Source: Elastic Endgame","Data Source: Elastic Defend","Data Source: System","Data Source: Microsoft Defender for Endpoint","Data Source: Sysmon","Data Source: SentinelOne"],"timestamp_override":"event.ingested","type":"eql","query":"process where host.os.type == \"windows\" and event.type == \"start\" and\n ((process.name : \"net.exe\" or ?process.pe.original_file_name == \"net.exe\") or ((process.name : \"net1.exe\" or ?process.pe.original_file_name == \"net1.exe\") and\n not process.parent.name : \"net.exe\")) and\n process.args : \"use\" and\n /* including hidden and webdav based online shares such as onedrive  */\n process.args : (\"\\\\\\\\*\\\\*$*\", \"\\\\\\\\*@SSL\\\\*\", \"http*\") and\n /* excluding shares deletion operation */\n not process.args : \"/d*\"\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1021","name":"Remote Services","reference":"https://attack.mitre.org/techniques/T1021/","subtechnique":[{"id":"T1021.002","name":"SMB/Windows Admin Shares","reference":"https://attack.mitre.org/techniques/T1021/002/"}]}],"tactic":{"id":"TA0008","name":"Lateral Movement","reference":"https://attack.mitre.org/tactics/TA0008/"}},{"framework":"MITRE ATT&CK","technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[{"id":"T1078.003","name":"Local Accounts","reference":"https://attack.mitre.org/techniques/T1078/003/"}]}],"tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"}},{"framework":"MITRE ATT&CK","technique":[{"id":"T1087","name":"Account Discovery","reference":"https://attack.mitre.org/techniques/T1087/","subtechnique":[{"id":"T1087.001","name":"Local Account","reference":"https://attack.mitre.org/techniques/T1087/001/"},{"id":"T1087.002","name":"Domain Account","reference":"https://attack.mitre.org/techniques/T1087/002/"}]}],"tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"}}]}}},"__N_SSG":true}