{"pageProps":{"rule":{"metadata":{"creation_date":"2020/12/21","integration":["endpoint"],"maturity":"production","min_stack_comments":"New fields added: required_fields, related_integrations, setup","min_stack_version":"8.3.0","updated_date":"2023/08/24"},"rule":{"author":["Elastic"],"description":"Adversaries may modify SSH related binaries for persistence or credential access by patching sensitive functions to\nenable unauthorized access or by logging SSH credentials for exfiltration.\n","false_positives":["Trusted OpenSSH executable updates. It's recommended to verify the integrity of OpenSSH binary changes."],"from":"now-9m","index":["auditbeat-*","logs-endpoint.events.*","endgame-*"],"language":"kuery","license":"Elastic License v2","name":"Modification of OpenSSH Binaries","references":["https://blog.angelalonso.es/2016/09/anatomy-of-real-linux-intrusion-part-ii.html"],"risk_score":47,"rule_id":"0415f22a-2336-45fa-ba07-618a5942e22c","severity":"medium","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Credential Access","Tactic: Persistence","Tactic: Lateral Movement","Data Source: Elastic Endgame","Data Source: Elastic Defend"],"timestamp_override":"event.ingested","type":"query","query":"event.category:file and host.os.type:linux and event.type:change and \n  process.name:(* and not (dnf or dnf-automatic or dpkg or yum or rpm or yum-cron or anacron)) and \n  (file.path:(/usr/bin/scp or \n                /usr/bin/sftp or \n                /usr/bin/ssh or \n                /usr/sbin/sshd) or \n  file.name:libkeyutils.so)\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1543","name":"Create or Modify System Process","reference":"https://attack.mitre.org/techniques/T1543/"}],"tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"}},{"framework":"MITRE ATT&CK","technique":[{"id":"T1556","name":"Modify Authentication Process","reference":"https://attack.mitre.org/techniques/T1556/"}],"tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"}},{"framework":"MITRE ATT&CK","technique":[{"id":"T1021","name":"Remote Services","reference":"https://attack.mitre.org/techniques/T1021/","subtechnique":[{"id":"T1021.004","name":"SSH","reference":"https://attack.mitre.org/techniques/T1021/004/"}]},{"id":"T1563","name":"Remote Service Session Hijacking","reference":"https://attack.mitre.org/techniques/T1563/","subtechnique":[{"id":"T1563.001","name":"SSH Hijacking","reference":"https://attack.mitre.org/techniques/T1563/001/"}]}],"tactic":{"id":"TA0008","name":"Lateral Movement","reference":"https://attack.mitre.org/tactics/TA0008/"}}]}}},"__N_SSG":true}