{"pageProps":{"rule":{"metadata":{"creation_date":"2023/07/04","integration":["endpoint"],"maturity":"production","min_stack_comments":"New fields added: required_fields, related_integrations, setup","min_stack_version":"8.3.0","updated_date":"2023/08/10"},"rule":{"author":["Elastic"],"description":"This detection rule detects the creation of a shell through a suspicious parent child relationship. Any reverse shells\nspawned by the specified utilities that use a forked process to initialize the connection attempt will be captured \nthrough this rule. Attackers may spawn reverse shells to establish persistence onto a target system. \n","from":"now-9m","index":["logs-endpoint.events.*"],"language":"eql","license":"Elastic License v2","name":"Potential Reverse Shell via Suspicious Parent Process","references":["https://github.com/swisskyrepo/PayloadsAllTheThings/blob/master/Methodology%20and%20Resources/Reverse%20Shell%20Cheatsheet.md"],"risk_score":47,"rule_id":"4b1a807a-4e7b-414e-8cea-24bf580f6fc5","severity":"medium","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Execution","Data Source: Elastic Defend"],"type":"eql","query":"sequence by host.id, process.parent.entity_id with maxspan=1s\n[ process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"fork\" and (\n  (process.name : \"python*\" and process.args : \"-c\") or\n  (process.name : \"php*\" and process.args : \"-r\") or\n  (process.name : \"perl\" and process.args : \"-e\") or\n  (process.name : \"ruby\" and process.args : (\"-e\", \"-rsocket\")) or\n  (process.name : \"lua*\" and process.args : \"-e\") or\n  (process.name : \"openssl\" and process.args : \"-connect\") or\n  (process.name : (\"nc\", \"ncat\", \"netcat\") and process.args_count >= 3) or\n  (process.name : \"telnet\" and process.args_count >= 3) or\n  (process.name : \"awk\")) and \n  process.parent.name : (\"python*\", \"php*\", \"perl\", \"ruby\", \"lua*\", \"openssl\", \"nc\", \"netcat\", \"ncat\", \"telnet\", \"awk\") ]\n[ network where host.os.type == \"linux\" and event.type == \"start\" and event.action in (\"connection_attempted\", \"connection_accepted\") and \n  process.name : (\"python*\", \"php*\", \"perl\", \"ruby\", \"lua*\", \"openssl\", \"nc\", \"netcat\", \"ncat\", \"telnet\", \"awk\") and\n  destination.ip != null and destination.ip != \"127.0.0.1\" and destination.ip != \"::1\" ]\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"name":"Execution","id":"TA0002","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059/","subtechnique":[{"id":"T1059.004","name":"Unix Shell","reference":"https://attack.mitre.org/techniques/T1059/004/"}]}]},{"framework":"MITRE ATT&CK","tactic":{"name":"Command and Control","id":"TA0011","reference":"https://attack.mitre.org/tactics/TA0011/"},"technique":[{"name":"Application Layer Protocol","id":"T1071","reference":"https://attack.mitre.org/techniques/T1071/"}]}]}}},"__N_SSG":true}