{"pageProps":{"rule":{"metadata":{"creation_date":"2020/11/03","integration":["endpoint","windows"],"maturity":"production","min_stack_comments":"New fields added: required_fields, related_integrations, setup","min_stack_version":"8.3.0","updated_date":"2023/06/22"},"rule":{"author":["Elastic"],"description":"Identifies the deletion of WebServer access logs. This may indicate an attempt to evade detection or destroy forensic\nevidence on a system.\n","from":"now-9m","index":["auditbeat-*","winlogbeat-*","logs-endpoint.events.*","logs-windows.*"],"language":"eql","license":"Elastic License v2","name":"WebServer Access Logs Deleted","note":"## Setup\n\nIf enabling an EQL rule on a non-elastic-agent index (such as beats) for versions <8.2, events will not define `event.ingested` and default fallback for EQL rules was not added until 8.2, so you will need to add a custom pipeline to populate `event.ingested` to @timestamp for this rule to work.\n","risk_score":47,"rule_id":"665e7a4f-c58e-4fc6-bc83-87a7572670ac","severity":"medium","tags":["Domain: Endpoint","OS: Linux","OS: Windows","OS: macOS","Use Case: Threat Detection","Tactic: Defense Evasion","Data Source: Elastic Defend"],"timestamp_override":"event.ingested","type":"eql","query":"file where event.type == \"deletion\" and\n  file.path : (\"C:\\\\inetpub\\\\logs\\\\LogFiles\\\\*.log\",\n               \"/var/log/apache*/access.log\",\n               \"/etc/httpd/logs/access_log\",\n               \"/var/log/httpd/access_log\",\n               \"/var/www/*/logs/access.log\")\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1070","name":"Indicator Removal","reference":"https://attack.mitre.org/techniques/T1070/"}],"tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"}}]}}},"__N_SSG":true}