{"pageProps":{"rule":{"metadata":{"creation_date":"2020/03/25","integration":["endpoint","windows"],"maturity":"production","updated_date":"2024/05/21"},"rule":{"anomaly_threshold":50,"author":["Elastic"],"description":"A machine learning job detected activity for a username that is not normally active, which can indicate unauthorized\nchanges, activity by unauthorized users, lateral movement, or compromised credentials. In many organizations, new\nusernames are not often created apart from specific types of system activities, such as creating new accounts for new\nemployees. These user accounts quickly become active and routine. Events from rarely used usernames can point to\nsuspicious activity. Additionally, automated Linux fleets tend to see activity from rarely used usernames only when\npersonnel log in to make authorized or unauthorized changes, or threat actors have acquired credentials and log in for\nmalicious purposes. Unusual usernames can also indicate pivoting, where compromised credentials are used to try and move\nlaterally from one host to another.\n","false_positives":["    Uncommon user activity can be due to an administrator or help desk technician logging onto a workstation or server\n    in order to perform manual troubleshooting or reconfiguration.\n    "],"from":"now-45m","interval":"15m","license":"Elastic License v2","machine_learning_job_id":["v3_windows_anomalous_user_name"],"name":"Unusual Windows Username","note":"## Triage and analysis\n\n### Investigating an Unusual Windows User\nDetection alerts from this rule indicate activity for a Windows user name that is rare and unusual. Here are some possible avenues of investigation:\n- Consider the user as identified by the username field. Is this program part of an expected workflow for the user who ran this program on this host? Could this be related to occasional troubleshooting or support activity?\n- Examine the history of user activity. If this user only manifested recently, it might be a service account for a new software package. If it has a consistent cadence (for example if it runs monthly or quarterly), it might be part of a monthly or quarterly business process.\n- Examine the process arguments, title and working directory. These may provide indications as to the source of the program or the nature of the tasks that the user is performing.\n- Consider the same for the parent process. If the parent process is a legitimate system utility or service, this could be related to software updates or system management. If the parent process is something user-facing like an Office application, this process could be more suspicious.","references":["https://www.elastic.co/guide/en/security/current/prebuilt-ml-jobs.html"],"risk_score":21,"rule_id":"1781d055-5c66-4adf-9c59-fc0fa58336a5","severity":"low","tags":["Domain: Endpoint","OS: Windows","Use Case: Threat Detection","Rule Type: ML","Rule Type: Machine Learning","Tactic: Initial Access"],"type":"machine_learning","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[{"id":"T1078.002","name":"Domain Accounts","reference":"https://attack.mitre.org/techniques/T1078/002/"},{"id":"T1078.003","name":"Local Accounts","reference":"https://attack.mitre.org/techniques/T1078/003/"}]}],"tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"}}]}}},"__N_SSG":true}