{"pageProps":{"rule":{"metadata":{"creation_date":"2026/02/04","integration":["kubernetes"],"maturity":"production","updated_date":"2026/02/04"},"rule":{"author":["Elastic"],"description":"This rule detects the creation of RoleBindings or ClusterRoleBindings that reference a ServiceAccount,\nwhich may indicate privilege delegation or potential RBAC misconfiguration leading to elevated access.\n","index":["logs-kubernetes.audit_logs-*"],"language":"kuery","license":"Elastic License v2","name":"Kubernetes Creation of a RoleBinding Referencing a ServiceAccount","references":["https://heilancoos.github.io/research/2025/12/16/kubernetes.html#overly-permissive-role-based-access-control"],"risk_score":47,"rule_id":"fd00769d-b18d-450a-a844-7a9f9c71995e","severity":"medium","tags":["Data Source: Kubernetes","Domain: Kubernetes","Use Case: Threat Detection","Tactic: Persistence","Tactic: Privilege Escalation","Language: kuery"],"timestamp_override":"event.ingested","type":"query","query":"event.dataset: \"kubernetes.audit_logs\" and kubernetes.audit.requestObject.spec.serviceAccountName:* and\nkubernetes.audit.verb:\"create\" and kubernetes.audit.objectRef.resource:(\"rolebindings\" or \"clusterrolebindings\") and\nkubernetes.audit.annotations.authorization_k8s_io/decision:\"allow\"\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1098","name":"Account Manipulation","reference":"https://attack.mitre.org/techniques/T1098/","subtechnique":[{"id":"T1098.006","name":"Additional Container Cluster Roles","reference":"https://attack.mitre.org/techniques/T1098/006/"}]}],"tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"}},{"framework":"MITRE ATT&CK","technique":[{"id":"T1098","name":"Account Manipulation","reference":"https://attack.mitre.org/techniques/T1098/","subtechnique":[{"id":"T1098.006","name":"Additional Container Cluster Roles","reference":"https://attack.mitre.org/techniques/T1098/006/"}]}],"tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"}}]}}},"__N_SSG":true}