{"pageProps":{"rule":{"metadata":{"creation_date":"2026/02/04","integration":["kubernetes"],"maturity":"production","updated_date":"2026/02/04"},"rule":{"author":["Elastic"],"description":"Detects the creation or modification of Kubernetes Roles or ClusterRoles that grant high-risk permissions,\nsuch as wildcard access or RBAC escalation verbs (e.g., bind, escalate, impersonate), which may enable\nprivilege escalation or unauthorized access within the cluster.\n","language":"esql","license":"Elastic License v2","name":"Kubernetes Creation or Modification of Sensitive Role","references":["https://heilancoos.github.io/research/2025/12/16/kubernetes.html#overly-permissive-role-based-access-control"],"risk_score":47,"rule_id":"0fb25791-d8d4-42ab-8fc7-4954642de85f","severity":"medium","tags":["Data Source: Kubernetes","Domain: Kubernetes","Use Case: Threat Detection","Tactic: Persistence","Tactic: Privilege Escalation","Language: esql"],"timestamp_override":"event.ingested","type":"esql","query":"FROM logs-kubernetes.audit_logs-* metadata _id, _index, _version\n| WHERE\n  kubernetes.audit.objectRef.resource in (\"roles\", \"clusterroles\") and\n  kubernetes.audit.verb in (\"create\", \"update\", \"patch\") and\n  `kubernetes.audit.annotations.authorization_k8s_io/decision` == \"allow\" and\n  kubernetes.audit.level == \"RequestResponse\" and kubernetes.audit.stage == \"ResponseComplete\" and\n  KQL(\"\"\"kubernetes.audit.requestObject.rules.verbs:(\"*\" or \"escalate\" or \"bind\" or \"impersonate\") or kubernetes.audit.requestObject.rules.resources:(\"clusterroles\" or \"clusterrolebindings\" or \"roles\" or \"rolebindings\")\"\"\")\n| KEEP\n  @timestamp,\n  data_stream.namespace,\n  `kubernetes.audit.annotations.authorization_k8s_io/decision`,\n  kubernetes.audit.level,\n  kubernetes.audit.objectRef.name,\n  kubernetes.audit.objectRef.resource,\n  kubernetes.audit.requestURI,\n  kubernetes.audit.responseStatus.code,\n  kubernetes.audit.sourceIPs,\n  kubernetes.audit.stage,\n  kubernetes.audit.user.groups,\n  kubernetes.audit.user.username,\n  kubernetes.audit.userAgent,\n  kubernetes.audit.verb,\n  _id,\n  _index,\n  _version\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1098","name":"Account Manipulation","reference":"https://attack.mitre.org/techniques/T1098/","subtechnique":[{"id":"T1098.006","name":"Additional Container Cluster Roles","reference":"https://attack.mitre.org/techniques/T1098/006/"}]}],"tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"}},{"framework":"MITRE ATT&CK","technique":[{"id":"T1098","name":"Account Manipulation","reference":"https://attack.mitre.org/techniques/T1098/","subtechnique":[{"id":"T1098.006","name":"Additional Container Cluster Roles","reference":"https://attack.mitre.org/techniques/T1098/006/"}]}],"tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"}}]}}},"__N_SSG":true}