{"pageProps":{"rule":{"metadata":{"creation_date":"2023/07/06","integration":["endpoint"],"maturity":"production","min_stack_comments":"New fields added: required_fields, related_integrations, setup","min_stack_version":"8.3.0","updated_date":"2024/04/05"},"rule":{"author":["Elastic"],"description":"Identifies the image load of a compression DLL. Adversaries will often compress and encrypt data in preparation for\nexfiltration.\n","from":"now-119m","interval":"60m","index":["logs-endpoint.events.library-*"],"language":"eql","license":"Elastic License v2","name":"Compression DLL Loaded by Unusual Process","risk_score":21,"rule_id":"d197478e-39f0-4347-a22f-ba654718b148","severity":"low","tags":["Domain: Endpoint","OS: Windows","Use Case: Threat Detection","Tactic: Collection","Data Source: Elastic Defend","Rule Type: BBR"],"timestamp_override":"event.ingested","type":"eql","building_block_type":"default","query":"library where host.os.type == \"windows\" and event.action == \"load\" and\n  dll.name : (\"System.IO.Compression.FileSystem.ni.dll\", \"System.IO.Compression.ni.dll\") and\n  not \n  (\n    (\n      process.executable : (\n        \"?:\\\\Program Files\\\\*\",\n        \"?:\\\\Program Files (x86)\\\\*\",\n        \"?:\\\\Windows\\\\Microsoft.NET\\\\Framework*\\\\mscorsvw.exe\",\n        \"?:\\\\Windows\\\\System32\\\\sdiagnhost.exe\",\n        \"?:\\\\Windows\\\\System32\\\\inetsrv\\\\w3wp.exe\",\n        \"?:\\\\Windows\\\\SysWOW64\\\\inetsrv\\\\w3wp.exe\",\n        \"?:\\\\ProgramData\\\\Microsoft\\\\Windows Defender Advanced Threat Protection\\\\DataCollection\\\\*\\\\OpenHandleCollector.exe\"\n      ) and process.code_signature.trusted == true\n    ) or\n    (\n      process.name : \"NuGet.exe\" and process.code_signature.trusted == true and user.id : (\"S-1-5-18\", \"S-1-5-20\")\n    )\n  )\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1560","name":"Archive Collected Data","reference":"https://attack.mitre.org/techniques/T1560/"}],"tactic":{"id":"TA0009","name":"Collection","reference":"https://attack.mitre.org/tactics/TA0009/"}}]}}},"__N_SSG":true}