{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunting query identifies when a public client app fails to retrieve an OAuth access token using client credentials because of an uauthorized scope. Adversaries may attempt to retrieve access tokens using client credentials to bypass user authentication and access resources. This query identifies when a public client app fails to retrieve an access token using client credentials and scopes that are not implicitly granted.\n","integration":["okta"],"uuid":"0b936024-71d9-11ef-a9be-f661ea17fbcc","name":"Failed OAuth Access Token Retrieval via Public Client App","language":["ES|QL"],"license":"Elastic License v2","notes":["Review `okta.debug_context.debug_data.flattened.grantType` to identify if the grant type is `client_credentials`","Ignore `okta.debug_context.debug_data.flattened.requestedScopes` values that indicate read-only access","Review `okta.actor.display_name` to identify the public client app that attempted to retrieve the access token. This may help identify the compromised client credentials.","Pivot for successful access token retrieval by the same public client app by searching `event.action` equal to `app.oauth2.as.token.grant.access_token` where the display name is the same."],"mitre":["T1550.001"],"query":["from logs-okta.system*\n| where @timestamp > NOW() - 7 day\n| where\n    event.dataset == \"okta.system\"\n\n    // filter on failed access token grant requests where source is a public client app\n    and event.action == \"app.oauth2.as.token.grant\"\n    and okta.actor.type == \"PublicClientApp\"\n    and okta.outcome.result == \"FAILURE\"\n\n    // filter out known Okta and Datadog actors\n    and not (\n        okta.actor.display_name LIKE \"Okta%\"\n        or okta.actor.display_name LIKE \"Datadog%\"\n    )\n\n    // filter for scopes that are not implicitly granted\n    and okta.outcome.reason == \"no_matching_scope\"\n\n| keep @timestamp, event.action, okta.actor.type, okta.outcome.result, okta.outcome.reason, okta.actor.display_name\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-okta.system*\n| where @timestamp > NOW() - 7 day\n| where\n    event.dataset == \"okta.system\"\n\n    // filter on failed access token grant requests where source is a public client app\n    and event.action == \"app.oauth2.as.token.grant\"\n    and okta.actor.type == \"PublicClientApp\"\n    and okta.outcome.result == \"FAILURE\"\n\n    // filter out known Okta and Datadog actors\n    and not (\n        okta.actor.display_name LIKE \"Okta%\"\n        or okta.actor.display_name LIKE \"Datadog%\"\n    )\n\n    // filter for scopes that are not implicitly granted\n    and okta.outcome.reason == \"no_matching_scope\"\n\n| keep @timestamp, event.action, okta.actor.type, okta.outcome.result, okta.outcome.reason, okta.actor.display_name\n"],"license":"Elastic License v2","description":"This hunting query identifies when a public client app fails to retrieve an OAuth access token using client credentials because of an uauthorized scope. Adversaries may attempt to retrieve access tokens using client credentials to bypass user authentication and access resources. This query identifies when a public client app fails to retrieve an access token using client credentials and scopes that are not implicitly granted.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1550","name":"","reference":"https://attack.mitre.org/techniques/T1550/","subtechnique":[{"id":"T1550.001","reference":"https://attack.mitre.org/techniques/T1550/001/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["okta"]}}},"__N_SSG":true}