{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunt identifies uncommon process executions from suspicious directories on Linux systems. It looks for processes executed from directories that are often associated with malicious activity, such as /dev/shm, /var/www, /boot, /srv, /tmp, /var/tmp, /run, and /var/run. The goal is to detect potentially malicious processes while excluding common, benign ones.\n","integration":["endpoint"],"uuid":"0ea47044-b161-4785-ba99-e11f46d6ac51","name":"Uncommon Process Execution from Suspicious Directory","language":["ES|QL"],"license":"Elastic License v2","notes":["Excluded /tmp, /var/tmp, /run, /var/run subdirectories to reduce noise.","Excluded /tmp, /var/tmp files starting or ending with digits to exclude real temporary files.","Included a process or parent process count of <= 3, and a host count of <= 3 to eliminate common processes across different hosts."],"mitre":["T1036.004","T1049","T1059","T1059.004"],"query":["from logs-endpoint.events.process-*\n| where @timestamp > now() - 7 day\n| where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and (\n// Add paths to monitor from your environment here\n  process.executable like \"/dev/shm/*\" or\n  process.executable like \"/var/www/*\" or\n  process.executable like \"/boot/*\" or\n  process.executable like \"/srv/*\" or\n  process.executable rlike \"/tmp/[^/]+\" or\n  process.executable rlike \"/var/tmp/[^/]+\" or\n  process.executable rlike \"/run/[^/]+\" or\n  process.executable rlike \"/var/run/[^/]+\"\n) and not (\n  // Exclude noisy (parent) processes, users or directories from your environment here\n  process.parent.executable in (\"/usr/sbin/dpkg-preconfigure\") or\n  // Exclude /tmp and /var/tmp instances starting or ending with digits (usually benign files)\n  process.executable rlike \"/tmp/[0-9].*\" or\n  process.executable rlike \"/tmp/.*[0-9]/?\" or\n  process.executable rlike \"/var/tmp/[0-9].*\" or\n  process.executable rlike \"/var/tmp/.*[0-9]/?\"\n)\n| stats cc = count(), host_count = count_distinct(host.name) by process.executable, process.parent.executable\n// Alter this threshold to make sense for your environment\n| where cc <= 3 and host_count <= 3\n| sort cc asc\n| limit 100\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-endpoint.events.process-*\n| where @timestamp > now() - 7 day\n| where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and (\n// Add paths to monitor from your environment here\n  process.executable like \"/dev/shm/*\" or\n  process.executable like \"/var/www/*\" or\n  process.executable like \"/boot/*\" or\n  process.executable like \"/srv/*\" or\n  process.executable rlike \"/tmp/[^/]+\" or\n  process.executable rlike \"/var/tmp/[^/]+\" or\n  process.executable rlike \"/run/[^/]+\" or\n  process.executable rlike \"/var/run/[^/]+\"\n) and not (\n  // Exclude noisy (parent) processes, users or directories from your environment here\n  process.parent.executable in (\"/usr/sbin/dpkg-preconfigure\") or\n  // Exclude /tmp and /var/tmp instances starting or ending with digits (usually benign files)\n  process.executable rlike \"/tmp/[0-9].*\" or\n  process.executable rlike \"/tmp/.*[0-9]/?\" or\n  process.executable rlike \"/var/tmp/[0-9].*\" or\n  process.executable rlike \"/var/tmp/.*[0-9]/?\"\n)\n| stats cc = count(), host_count = count_distinct(host.name) by process.executable, process.parent.executable\n// Alter this threshold to make sense for your environment\n| where cc <= 3 and host_count <= 3\n| sort cc asc\n| limit 100\n"],"license":"Elastic License v2","description":"This hunt identifies uncommon process executions from suspicious directories on Linux systems. It looks for processes executed from directories that are often associated with malicious activity, such as /dev/shm, /var/www, /boot, /srv, /tmp, /var/tmp, /run, and /var/run. The goal is to detect potentially malicious processes while excluding common, benign ones.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1036","name":"","reference":"https://attack.mitre.org/techniques/T1036/","subtechnique":[{"id":"T1036.004","reference":"https://attack.mitre.org/techniques/T1036/004/"}]},{"id":"T1049","name":"","reference":"https://attack.mitre.org/techniques/T1049/"},{"id":"T1059","name":"","reference":"https://attack.mitre.org/techniques/T1059/"},{"id":"T1059","name":"","reference":"https://attack.mitre.org/techniques/T1059/","subtechnique":[{"id":"T1059.004","reference":"https://attack.mitre.org/techniques/T1059/004/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["endpoint"]}}},"__N_SSG":true}