{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunting query gathers data from AWS CloudTrail logs to identify unusual AWS access key usage for a user. By detecting instances where an access key is used infrequently for a specific AWS event, this query helps identify potential misuse or abuse of AWS access keys. Adversaries may use access keys to gain unauthorized access to AWS resources, exfiltrate data, or perform other malicious activities within the environment.\n","integration":["aws.cloudtrail"],"uuid":"18ce3dbc-b1b3-11ef-9e63-f661ea17fbce","name":"AWS IAM Unusual AWS Access Key Usage for User","language":["ES|QL"],"license":"Elastic License v2","notes":["Review the `aws.cloudtrail.user_identity.arn` and `aws.cloudtrail.user_identity.access_key_id` fields to identify the user and access key involved in the unusual access key usage.","Review the infrequente AWS events (`event.action`), associated with the access key to determine the potential impact of the unusual access key usage.","Within AWS, determine is the access key is temporary or permanent and if it is associated with a specific user or role.","If the access key is associated with a specific role, review the permissions and policies associated with the role to determine the potential impact of the unusual access key usage.","If the access key is associated with an assumed role, review the resources assigned to the role. Consider pivoting on EC2 or Lambda-based roles if identified and examine session metadata within the last 24-hours.","Consider reviewing the `source.address` field to identify the IP address of the actor responsible for the unusual access key usage.","If the access key is perminant and tied to a user or role, consider rotating the access key to prevent further unauthorized access."],"mitre":["T1078.004"],"query":["FROM logs-aws.cloudtrail*\n// Limit the search to the last 14 days\n| WHERE @timestamp > now() - 14 day\n| WHERE\n    // Filter for successful AWS CloudTrail events\n    event.dataset == \"aws.cloudtrail\"\n    and event.outcome == \"success\"\n\n    // Filter for AWS CloudTrail events with user identity and access key information\n    and aws.cloudtrail.user_identity.access_key_id IS NOT NULL\n    and aws.cloudtrail.resources.arn IS NOT NULL\n\n    // Ignore GetObject events\n    and event.action NOT IN (\"GetObject\")\n\n    // Filter out known service roles; expand this as needed\n    and NOT aws.cloudtrail.user_identity.arn LIKE \"*AWSServiceRoleForConfig*\"\n    and NOT aws.cloudtrail.user_identity.arn LIKE \"*Elastic-Cloud-Security-Posture*\"\n    and NOT aws.cloudtrail.user_identity.arn LIKE \"*AmazonSSMRoleForInstancesQuickSetup*\"\n\n| STATS\n    // Count the number of events for each daily bucket, user identity, access key, resource, and action\n    api_counts = count(*) by aws.cloudtrail.user_identity.arn, aws.cloudtrail.user_identity.access_key_id, event.action\n\n// Filter for access keys with less than 2 API calls per day\n| WHERE api_counts < 2\n| SORT api_counts ASC\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["FROM logs-aws.cloudtrail*\n// Limit the search to the last 14 days\n| WHERE @timestamp > now() - 14 day\n| WHERE\n    // Filter for successful AWS CloudTrail events\n    event.dataset == \"aws.cloudtrail\"\n    and event.outcome == \"success\"\n\n    // Filter for AWS CloudTrail events with user identity and access key information\n    and aws.cloudtrail.user_identity.access_key_id IS NOT NULL\n    and aws.cloudtrail.resources.arn IS NOT NULL\n\n    // Ignore GetObject events\n    and event.action NOT IN (\"GetObject\")\n\n    // Filter out known service roles; expand this as needed\n    and NOT aws.cloudtrail.user_identity.arn LIKE \"*AWSServiceRoleForConfig*\"\n    and NOT aws.cloudtrail.user_identity.arn LIKE \"*Elastic-Cloud-Security-Posture*\"\n    and NOT aws.cloudtrail.user_identity.arn LIKE \"*AmazonSSMRoleForInstancesQuickSetup*\"\n\n| STATS\n    // Count the number of events for each daily bucket, user identity, access key, resource, and action\n    api_counts = count(*) by aws.cloudtrail.user_identity.arn, aws.cloudtrail.user_identity.access_key_id, event.action\n\n// Filter for access keys with less than 2 API calls per day\n| WHERE api_counts < 2\n| SORT api_counts ASC\n"],"license":"Elastic License v2","description":"This hunting query gathers data from AWS CloudTrail logs to identify unusual AWS access key usage for a user. By detecting instances where an access key is used infrequently for a specific AWS event, this query helps identify potential misuse or abuse of AWS access keys. Adversaries may use access keys to gain unauthorized access to AWS resources, exfiltrate data, or perform other malicious activities within the environment.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1078","name":"","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[{"id":"T1078.004","reference":"https://attack.mitre.org/techniques/T1078/004/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["aws.cloudtrail"]}}},"__N_SSG":true}