{"pageProps":{"rule":{"metadata":{"creation_date":"2023/09/25","integration":["endpoint"],"maturity":"production","updated_date":"2024/05/21"},"rule":{"author":["Elastic"],"building_block_type":"default","description":"Identifies child processes of frequently targeted Microsoft Office applications (Word, PowerPoint, Excel) with unusual\nprocess arguments and path. This behavior is often observed during exploitation of Office applications or from documents\nwith malicious macros.\n","from":"now-119m","index":["logs-endpoint.events.process-*"],"interval":"60m","language":"eql","license":"Elastic License v2","name":"Potential Process Injection from Malicious Document","risk_score":21,"rule_id":"1c5a04ae-d034-41bf-b0d8-96439b5cc774","severity":"low","tags":["Domain: Endpoint","OS: Windows","Use Case: Threat Detection","Tactic: Defense Evasion","Tactic: Privilege Escalation","Tactic: Initial Access","Rule Type: BBR","Data Source: Elastic Defend","Language: eql"],"timestamp_override":"event.ingested","type":"eql","query":"process where host.os.type == \"windows\" and event.action == \"start\" and\n  process.parent.name : (\"excel.exe\", \"powerpnt.exe\", \"winword.exe\") and\n  process.args_count == 1 and\n  process.executable : (\n    \"?:\\\\Windows\\\\SysWOW64\\\\*.exe\", \"?:\\\\Windows\\\\system32\\\\*.exe\"\n  ) and\n  not (process.executable : \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\*\" and\n       process.code_signature.trusted == true and not process.code_signature.subject_name : \"Microsoft *\") and\n  not process.executable : (\n    \"?:\\\\Windows\\\\Sys*\\\\Taskmgr.exe\",\n    \"?:\\\\Windows\\\\Sys*\\\\ctfmon.exe\",\n    \"?:\\\\Windows\\\\System32\\\\notepad.exe\")\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055/"}],"tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"}},{"framework":"MITRE ATT&CK","technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055/"}],"tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"}},{"framework":"MITRE ATT&CK","technique":[{"id":"T1566","name":"Phishing","reference":"https://attack.mitre.org/techniques/T1566/","subtechnique":[{"id":"T1566.001","name":"Spearphishing Attachment","reference":"https://attack.mitre.org/techniques/T1566/001/"}]}],"tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"}}]}}},"__N_SSG":true}