{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunt identifies potential persistence mechanisms via modifications to shell profile files on Linux systems. It monitors file creation or modification events in system-wide and user-specific profile files, which can indicate attempts to establish persistence through shell modifications. It also monitors processes started by SSH daemons to detect suspicious activity related to SSH logins.\n","integration":["endpoint"],"uuid":"20a02fad-2a09-44c0-a8ce-ce4502859c8a","name":"Shell Modification Persistence","language":["ES|QL","SQL"],"license":"Elastic License v2","notes":["Monitors for file creation or modification events in system-wide and user-specific profile files, such as /etc/profile, /etc/bash.bashrc, /home/*/.bashrc, and others.","Excludes modifications made by expected update processes such as package managers to reduce false positives.","Uses EVAL to tag potential persistence events and counts occurrences to identify unusual activity.","Monitors processes started by SSH daemons (sshd) to detect suspicious activity related to SSH logins.","OSQuery query is provided to retrieve detailed file information related to profile files."],"mitre":["T1546.004","T1053.005"],"query":["from logs-endpoint.events.file-*\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.type in (\"creation\", \"change\") and (\n\n    // System-wide profile files\n    file.path in (\"/etc/profile\", \"/etc/bash.bashrc\", \"/etc/bash.bash_logout\") or\n    file.path like \"/etc/profile.d/*\" or\n\n    // root-specific profile files\n    file.path in (\"/root/.profile\", \"/root/.bash_profile\", \"/root/.bash_login\", \"/root/.bash_logout\", \"/root/.bashrc\") or\n\n    // User-specific profile files\n    file.path like \"/home/*/.profile\" or\n    file.path like \"/home/*/.bash_profile\" or\n    file.path like \"/home/*/.bash_login\" or\n    file.path like \"/home/*/.bash_logout\" or\n    file.path like \"/home/*/.bashrc\"\n) and not (\n    process.name in (\n      \"dpkg\", \"dockerd\", \"yum\", \"dnf\", \"snapd\", \"pacman\", \"pamac-daemon\", \"microdnf\", \"podman\", \"apk\"\n    ) or\n    process.executable == \"/proc/self/exe\" or\n    process.executable like \"/dev/fd/*\" or\n    file.extension in (\"dpkg-remove\", \"swx\", \"swp\")\n)\n| eval persistence = case(\n    // System-wide profile files\n    file.path in (\"/etc/profile\", \"/etc/bash.bashrc\", \"/etc/bash.bash_logout\") or\n    file.path like \"/etc/profile.d/*\" or\n\n    // root-specific profile files\n    file.path in (\"/root/.profile\", \"/root/.bash_profile\", \"/root/.bash_login\", \"/root/.bash_logout\", \"/root/.bashrc\") or\n\n    // User-specific profile files\n    file.path like \"/home/*/.profile\" or\n    file.path like \"/home/*/.bash_profile\" or\n    file.path like \"/home/*/.bash_login\" or\n    file.path like \"/home/*/.bash_logout\" or\n    file.path like \"/home/*/.bashrc\",\n    process.name,\n    null\n)\n| stats pers_count = count(persistence) by process.executable, file.path\n| where pers_count > 0 and pers_count <= 20\n| sort pers_count asc\n| limit 100\n","from logs-endpoint.events.process-*\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and process.parent.name == \"sshd\"\n| stats cc = count(*) by process.command_line\n| where cc <= 20\n| sort cc asc\n| limit 100\n","SELECT\n    f.filename,\n    f.path,\n    u.username AS file_owner,\n    g.groupname AS group_owner,\n    datetime(f.atime, 'unixepoch') AS file_last_access_time,\n    datetime(f.mtime, 'unixepoch') AS file_last_modified_time,\n    datetime(f.ctime, 'unixepoch') AS file_last_status_change_time,\n    datetime(f.btime, 'unixepoch') AS file_created_time,\n    f.size AS size_bytes\nFROM\n    file f\nLEFT JOIN\n    users u ON f.uid = u.uid\nLEFT JOIN\n    groups g ON f.gid = g.gid\nWHERE\n    f.path IN (\"/etc/profile\", \"/etc/bash.bashrc\", \"/etc/bash.bash_logout\")\n    OR f.path IN (\"/root/.profile\", \"/root/.bash_profile\", \"/root/.bash_login\", \"/root/.bash_logout\", \"/root/.bashrc\")\n    OR f.path LIKE \"/etc/profile.d/%\"\n    OR f.path LIKE \"/home/%/.profile\"\n    OR f.path LIKE \"/home/%/.bash_profile\"\n    OR f.path LIKE \"/home/%/.bash_login\"\n    OR f.path LIKE \"/home/%/.bash_logout\"\n    OR f.path LIKE \"/home/%/.bashrc\"\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-endpoint.events.file-*\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.type in (\"creation\", \"change\") and (\n\n    // System-wide profile files\n    file.path in (\"/etc/profile\", \"/etc/bash.bashrc\", \"/etc/bash.bash_logout\") or\n    file.path like \"/etc/profile.d/*\" or\n\n    // root-specific profile files\n    file.path in (\"/root/.profile\", \"/root/.bash_profile\", \"/root/.bash_login\", \"/root/.bash_logout\", \"/root/.bashrc\") or\n\n    // User-specific profile files\n    file.path like \"/home/*/.profile\" or\n    file.path like \"/home/*/.bash_profile\" or\n    file.path like \"/home/*/.bash_login\" or\n    file.path like \"/home/*/.bash_logout\" or\n    file.path like \"/home/*/.bashrc\"\n) and not (\n    process.name in (\n      \"dpkg\", \"dockerd\", \"yum\", \"dnf\", \"snapd\", \"pacman\", \"pamac-daemon\", \"microdnf\", \"podman\", \"apk\"\n    ) or\n    process.executable == \"/proc/self/exe\" or\n    process.executable like \"/dev/fd/*\" or\n    file.extension in (\"dpkg-remove\", \"swx\", \"swp\")\n)\n| eval persistence = case(\n    // System-wide profile files\n    file.path in (\"/etc/profile\", \"/etc/bash.bashrc\", \"/etc/bash.bash_logout\") or\n    file.path like \"/etc/profile.d/*\" or\n\n    // root-specific profile files\n    file.path in (\"/root/.profile\", \"/root/.bash_profile\", \"/root/.bash_login\", \"/root/.bash_logout\", \"/root/.bashrc\") or\n\n    // User-specific profile files\n    file.path like \"/home/*/.profile\" or\n    file.path like \"/home/*/.bash_profile\" or\n    file.path like \"/home/*/.bash_login\" or\n    file.path like \"/home/*/.bash_logout\" or\n    file.path like \"/home/*/.bashrc\",\n    process.name,\n    null\n)\n| stats pers_count = count(persistence) by process.executable, file.path\n| where pers_count > 0 and pers_count <= 20\n| sort pers_count asc\n| limit 100\n","from logs-endpoint.events.process-*\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and process.parent.name == \"sshd\"\n| stats cc = count(*) by process.command_line\n| where cc <= 20\n| sort cc asc\n| limit 100\n","SELECT\n    f.filename,\n    f.path,\n    u.username AS file_owner,\n    g.groupname AS group_owner,\n    datetime(f.atime, 'unixepoch') AS file_last_access_time,\n    datetime(f.mtime, 'unixepoch') AS file_last_modified_time,\n    datetime(f.ctime, 'unixepoch') AS file_last_status_change_time,\n    datetime(f.btime, 'unixepoch') AS file_created_time,\n    f.size AS size_bytes\nFROM\n    file f\nLEFT JOIN\n    users u ON f.uid = u.uid\nLEFT JOIN\n    groups g ON f.gid = g.gid\nWHERE\n    f.path IN (\"/etc/profile\", \"/etc/bash.bashrc\", \"/etc/bash.bash_logout\")\n    OR f.path IN (\"/root/.profile\", \"/root/.bash_profile\", \"/root/.bash_login\", \"/root/.bash_logout\", \"/root/.bashrc\")\n    OR f.path LIKE \"/etc/profile.d/%\"\n    OR f.path LIKE \"/home/%/.profile\"\n    OR f.path LIKE \"/home/%/.bash_profile\"\n    OR f.path LIKE \"/home/%/.bash_login\"\n    OR f.path LIKE \"/home/%/.bash_logout\"\n    OR f.path LIKE \"/home/%/.bashrc\"\n"],"license":"Elastic License v2","description":"This hunt identifies potential persistence mechanisms via modifications to shell profile files on Linux systems. It monitors file creation or modification events in system-wide and user-specific profile files, which can indicate attempts to establish persistence through shell modifications. It also monitors processes started by SSH daemons to detect suspicious activity related to SSH logins.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1546","name":"","reference":"https://attack.mitre.org/techniques/T1546/","subtechnique":[{"id":"T1546.004","reference":"https://attack.mitre.org/techniques/T1546/004/"}]},{"id":"T1053","name":"","reference":"https://attack.mitre.org/techniques/T1053/","subtechnique":[{"id":"T1053.005","reference":"https://attack.mitre.org/techniques/T1053/005/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["endpoint"]}}},"__N_SSG":true}