{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunt aggregates process execution and remote network logons by source address, account name and process hash. It then limits the results by unique host within a 7 day period. This may indicate lateral movement via remote services.\n","integration":["endpoint"],"uuid":"24108755-4d1f-4d7a-ad5f-04c2ca55e9a3","name":"Frequency of Process Execution via Network Logon by Source Address","language":["ES|QL"],"license":"Elastic License v2","notes":["The second query highest occurrence of source addresses/accounts performing remote process execution","`process.Ext.session_info.*` is populated for Elastic Defend versions 8.6.0+ and above.","Execution via legitimate Microsoft processes for PowerShell and cmd need to be further investigated via aggregation by `process.command_line`.","Aggregation can be also done by `process.executable`, normalizing process path by removing random patterns using the ES|QL REPLACE function."],"mitre":["T1021"],"query":["from logs-endpoint.events.process-*\n| where  @timestamp > now() - 7 day and host.os.family == \"windows\" and\n  event.category == \"process\" and event.action == \"start\" and\n  /* network logon type and the execution is within 30 seconds of the logon time */\n  process.Ext.session_info.logon_type == \"Network\" and process.Ext.session_info.relative_logon_time <= 30\n| stats total = count(*) by process.Ext.session_info.client_address, user.name\n /* sort by top source.ip and account */\n| sort total desc\n","from logs-endpoint.events.process-*\n| where  @timestamp > now() - 7 day and host.os.family == \"windows\" and\n  event.category == \"process\" and event.action == \"start\" and\n  /* network logon type and the execution is within 30 seconds of the logon time */\n  process.Ext.session_info.logon_type == \"Network\" and process.Ext.session_info.relative_logon_time <= 30\n| stats total = count(*), hosts = count_distinct(host.id) by process.hash.sha256, process.Ext.session_info.client_address, user.name, process.parent.name\n /* unique hash limited to one host and number of execution is 1 */\n| where  hosts == 1 and total == 1\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-endpoint.events.process-*\n| where  @timestamp > now() - 7 day and host.os.family == \"windows\" and\n  event.category == \"process\" and event.action == \"start\" and\n  /* network logon type and the execution is within 30 seconds of the logon time */\n  process.Ext.session_info.logon_type == \"Network\" and process.Ext.session_info.relative_logon_time <= 30\n| stats total = count(*) by process.Ext.session_info.client_address, user.name\n /* sort by top source.ip and account */\n| sort total desc\n","from logs-endpoint.events.process-*\n| where  @timestamp > now() - 7 day and host.os.family == \"windows\" and\n  event.category == \"process\" and event.action == \"start\" and\n  /* network logon type and the execution is within 30 seconds of the logon time */\n  process.Ext.session_info.logon_type == \"Network\" and process.Ext.session_info.relative_logon_time <= 30\n| stats total = count(*), hosts = count_distinct(host.id) by process.hash.sha256, process.Ext.session_info.client_address, user.name, process.parent.name\n /* unique hash limited to one host and number of execution is 1 */\n| where  hosts == 1 and total == 1\n"],"license":"Elastic License v2","description":"This hunt aggregates process execution and remote network logons by source address, account name and process hash. It then limits the results by unique host within a 7 day period. This may indicate lateral movement via remote services.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1021","name":"","reference":"https://attack.mitre.org/techniques/T1021/"}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["endpoint"]}}},"__N_SSG":true}