{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunting query identifies when a user successfully signs on from more than one country in a 15 minute interval. Adversaries may compromise authentication credentials for users or clients and attempt to authenticate from a separate country that the user has not previously authenticated from.\n","integration":["okta"],"uuid":"31585786-71f4-11ef-9e99-f661ea17fbcc","name":"Successful Impossible Travel Sign-On Events","language":["ES|QL"],"license":"Elastic License v2","notes":["`okta.actor.alternate_id` would be target of the threat adversary","Pivoting into a potential compromise requires an additional search for `okta.outcome.result` being `SUCCESS` for any `user.authentication*` value for `okta.event_type`","Pivot to any additional Okta logs after authentication to determine if activity is still being reported by separate countries."],"mitre":["T1078.004"],"query":["from logs-okta.system*\n| where @timestamp > NOW() - 7 day\n| where event.dataset == \"okta.system\"\n\n    // filter on successful sign-on events only\n    and okta.event_type == \"policy.evaluate_sign_on\"\n    and okta.outcome.result in (\"ALLOW\", \"SUCCESS\")\n\n// Truncate the timestamp to 1 hour intervals\n| eval time_window = DATE_TRUNC(1 hours, @timestamp)\n\n// Count the number of successful sign-on events for each user every 15 minutes\n| stats country_count = count_distinct(client.geo.country_name) by okta.actor.alternate_id, time_window\n\n// Filter for users who sign on from more than one country in a 15 minute interval\n| where country_count >= 2\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-okta.system*\n| where @timestamp > NOW() - 7 day\n| where event.dataset == \"okta.system\"\n\n    // filter on successful sign-on events only\n    and okta.event_type == \"policy.evaluate_sign_on\"\n    and okta.outcome.result in (\"ALLOW\", \"SUCCESS\")\n\n// Truncate the timestamp to 1 hour intervals\n| eval time_window = DATE_TRUNC(1 hours, @timestamp)\n\n// Count the number of successful sign-on events for each user every 15 minutes\n| stats country_count = count_distinct(client.geo.country_name) by okta.actor.alternate_id, time_window\n\n// Filter for users who sign on from more than one country in a 15 minute interval\n| where country_count >= 2\n"],"license":"Elastic License v2","description":"This hunting query identifies when a user successfully signs on from more than one country in a 15 minute interval. Adversaries may compromise authentication credentials for users or clients and attempt to authenticate from a separate country that the user has not previously authenticated from.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1078","name":"","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[{"id":"T1078.004","reference":"https://attack.mitre.org/techniques/T1078/004/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["okta"]}}},"__N_SSG":true}