{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunt identifies segmentation faults (segfaults) and potential buffer overflow attacks on Linux systems by parsing syslog messages related to segfaults. It captures details about the crashing process, shared object file, and other relevant information to help identify and investigate potential exploitation attempts.\n","integration":["system"],"uuid":"3f3fd2b9-940c-4310-adb1-d8b7d726e281","name":"Segmentation Fault & Potential Buffer Overflow Hunting","language":["ES|QL"],"license":"Elastic License v2","notes":["Detects segfaults and parses syslog messages related to segfaults to identify the crashing process and shared object file along with additional crash details.","Uses GROK to extract relevant fields from syslog messages.","Counts occurrences of segfaults within a plain text message field to potentially detect buffer overflow attacks and unsuccessful process injection attempts.","Removes prepending spaces from syslog messages using EVAL to ensure consistent parsing.","Depending on the Syslog configuration, additional parsing may be required to extract the necessary fields from the message."],"mitre":["T1203","T1068"],"query":["from logs-system.syslog*\n| where @timestamp > now() - 12 hour\n| where host.os.type == \"linux\" and process.name == \"kernel\" and message like \"*segfault*\"\n| grok message \"\\\\[%{NUMBER:timestamp}\\\\] %{WORD:process}\\\\[%{NUMBER:pid}\\\\]: segfault at %{BASE16NUM:segfault_address} ip %{BASE16NUM:instruction_pointer} sp %{BASE16NUM:stack_pointer} error %{NUMBER:error_code} in %{DATA:so_file}\\\\[%{BASE16NUM:so_base_address}\\\\+%{BASE16NUM:so_offset}\\\\]\"\n| keep timestamp, process, pid, so_file, segfault_address, instruction_pointer, stack_pointer, error_code, so_base_address, so_offset\n","from logs-system.syslog*\n| where host.os.type == \"linux\" and process.name == \"kernel\" and message like \"*segfault*\"\n| where @timestamp > now() - 12 hour\n| grok message \"\\\\[%{DATA:timestamp}\\\\] %{WORD:process}\\\\[%{NUMBER:pid}\\\\]: segfault at %{BASE16NUM:segfault_address} ip %{BASE16NUM:instruction_pointer} sp %{BASE16NUM:stack_pointer} error %{NUMBER:error_code} in %{DATA:so_name}\\\\[%{BASE16NUM:so_base_address}\\\\+%{BASE16NUM:so_offset}\\\\] likely on CPU %{NUMBER:cpu} \\\\(core %{NUMBER:core}, socket %{NUMBER:socket}\\\\)\"\n| eval timestamp = REPLACE(timestamp, \"\\\\s+\", \"\")\n| keep timestamp, process, pid, segfault_address, instruction_pointer, stack_pointer, error_code, so_name, so_base_address, so_offset, cpu, core, socket\n| stats cc = count() by process, so_name\n// Alter this threshold to make sense for your environment\n| where cc > 100\n| limit 10\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-system.syslog*\n| where @timestamp > now() - 12 hour\n| where host.os.type == \"linux\" and process.name == \"kernel\" and message like \"*segfault*\"\n| grok message \"\\\\[%{NUMBER:timestamp}\\\\] %{WORD:process}\\\\[%{NUMBER:pid}\\\\]: segfault at %{BASE16NUM:segfault_address} ip %{BASE16NUM:instruction_pointer} sp %{BASE16NUM:stack_pointer} error %{NUMBER:error_code} in %{DATA:so_file}\\\\[%{BASE16NUM:so_base_address}\\\\+%{BASE16NUM:so_offset}\\\\]\"\n| keep timestamp, process, pid, so_file, segfault_address, instruction_pointer, stack_pointer, error_code, so_base_address, so_offset\n","from logs-system.syslog*\n| where host.os.type == \"linux\" and process.name == \"kernel\" and message like \"*segfault*\"\n| where @timestamp > now() - 12 hour\n| grok message \"\\\\[%{DATA:timestamp}\\\\] %{WORD:process}\\\\[%{NUMBER:pid}\\\\]: segfault at %{BASE16NUM:segfault_address} ip %{BASE16NUM:instruction_pointer} sp %{BASE16NUM:stack_pointer} error %{NUMBER:error_code} in %{DATA:so_name}\\\\[%{BASE16NUM:so_base_address}\\\\+%{BASE16NUM:so_offset}\\\\] likely on CPU %{NUMBER:cpu} \\\\(core %{NUMBER:core}, socket %{NUMBER:socket}\\\\)\"\n| eval timestamp = REPLACE(timestamp, \"\\\\s+\", \"\")\n| keep timestamp, process, pid, segfault_address, instruction_pointer, stack_pointer, error_code, so_name, so_base_address, so_offset, cpu, core, socket\n| stats cc = count() by process, so_name\n// Alter this threshold to make sense for your environment\n| where cc > 100\n| limit 10\n"],"license":"Elastic License v2","description":"This hunt identifies segmentation faults (segfaults) and potential buffer overflow attacks on Linux systems by parsing syslog messages related to segfaults. It captures details about the crashing process, shared object file, and other relevant information to help identify and investigate potential exploitation attempts.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1203","name":"","reference":"https://attack.mitre.org/techniques/T1203/"},{"id":"T1068","name":"","reference":"https://attack.mitre.org/techniques/T1068/"}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["system"]}}},"__N_SSG":true}