{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunt identifies potential persistence mechanisms via dynamic linker hijacking on Linux systems. Attackers can manipulate environment variables like LD_PRELOAD and LD_LIBRARY_PATH to execute malicious shared libraries, hijacking the dynamic linker process for persistence or privilege escalation. This hunt monitors for suspicious usage of these environment variables, the creation of shared library files (.so), and access to critical dynamic linker configuration files.\n","integration":["endpoint"],"uuid":"664d65ec-029e-4746-bf97-7bf3a0113e6a","name":"Persistence via Dynamic Linker Hijacking","language":["ES|QL","SQL"],"license":"Elastic License v2","notes":["Identifies processes with suspicious environment variables, specifically LD_PRELOAD and LD_LIBRARY_PATH, which are often used in dynamic linker hijacking attacks.","Monitors the creation of shared object (.so) files in non-standard or uncommon directories to detect potential malicious libraries.","Tracks modifications to critical dynamic linker files like /etc/ld.so.preload, /etc/ld.so.conf, and related directories, which are common targets for attackers.","Uses process environment variables and metadata to detect running processes that rely on suspicious linker configurations, focusing on processes that persist longer than typical short-lived tasks.","Provides complementary OSQuery queries for detailed file metadata, including file ownership and timestamps, to support forensic investigations.","This hunt leverages the process.env_vars field, which is a field that must be manually enabled within the Elastic Defend policy advanced settings tab."],"mitre":["T1574.006"],"query":["from logs-endpoint.events.process-*\n| keep @timestamp, host.os.type, event.type, event.action, process.env_vars, agent.id\n| where @timestamp > now() - 30 days\n| where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and\nprocess.env_vars like \"LD_PRELOAD=*.so\" or\nprocess.env_vars like \"LD_LIBRARY_PATH=*\"\n| stats env_count = count(process.env_vars) by agent.id, process.env_vars\n","from logs-endpoint.events.file-*\n| keep @timestamp, host.os.type, event.type, event.action, file.extension, file.path, process.executable, agent.id\n| where @timestamp > now() - 30 days\n| where host.os.type == \"linux\" and event.type == \"creation\" and file.extension == \"so\" and not (\n  // Add your exclusions here\n  file.path like \"/run/initramfs/*\" or\n  file.path like \"/var/tmp/mkinitramfs*\"\n)\n| stats cc = count(), agent_count = count_distinct(agent.id) by file.path, process.executable\n| where agent_count <= 3\n| sort cc asc\n| limit 100\n","SELECT * FROM process_envs\nWHERE key = \"LD_PRELOAD\"\nOR key = \"LD_LIBRARY_PATH\";\n","SELECT\n    f.filename,\n    f.path,\n    u.username AS file_owner,\n    g.groupname AS group_owner,\n    datetime(f.atime, 'unixepoch') AS file_last_access_time,\n    datetime(f.mtime, 'unixepoch') AS file_last_modified_time,\n    datetime(f.ctime, 'unixepoch') AS file_last_status_change_time\n    datetime(f.btime, 'unixepoch') AS file_created_time,\n    f.size AS size_bytes\nFROM\n    file f\nLEFT JOIN\n    users u ON f.uid = u.uid\nLEFT JOIN\n    groups g ON f.gid = g.gid\nWHERE\n    f.path = \"/etc/ld.so.preload\"\n    OR f.path = \"/etc/ld.so.conf\"\n    OR f.path = \"/etc/ld.so.cache\"\n    OR f.path LIKE \"/etc/ld.so.conf.d/%\";\n","SELECT \n    p.pid,\n    p.name AS process_name,\n    p.path AS process_path,\n    p.cmdline AS command_line,\n    pe.key AS env_key,\n    pe.value AS env_value,\n    (strftime('%s', 'now') - p.start_time) AS runtime_seconds\nFROM \n    processes p\nJOIN \n    process_envs pe ON p.pid = pe.pid\nWHERE \n    pe.key IN ('LD_PRELOAD', 'LD_LIBRARY_PATH')\n    AND (strftime('%s', 'now') - p.start_time) > 3600;\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-endpoint.events.process-*\n| keep @timestamp, host.os.type, event.type, event.action, process.env_vars, agent.id\n| where @timestamp > now() - 30 days\n| where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and\nprocess.env_vars like \"LD_PRELOAD=*.so\" or\nprocess.env_vars like \"LD_LIBRARY_PATH=*\"\n| stats env_count = count(process.env_vars) by agent.id, process.env_vars\n","from logs-endpoint.events.file-*\n| keep @timestamp, host.os.type, event.type, event.action, file.extension, file.path, process.executable, agent.id\n| where @timestamp > now() - 30 days\n| where host.os.type == \"linux\" and event.type == \"creation\" and file.extension == \"so\" and not (\n  // Add your exclusions here\n  file.path like \"/run/initramfs/*\" or\n  file.path like \"/var/tmp/mkinitramfs*\"\n)\n| stats cc = count(), agent_count = count_distinct(agent.id) by file.path, process.executable\n| where agent_count <= 3\n| sort cc asc\n| limit 100\n","SELECT * FROM process_envs\nWHERE key = \"LD_PRELOAD\"\nOR key = \"LD_LIBRARY_PATH\";\n","SELECT\n    f.filename,\n    f.path,\n    u.username AS file_owner,\n    g.groupname AS group_owner,\n    datetime(f.atime, 'unixepoch') AS file_last_access_time,\n    datetime(f.mtime, 'unixepoch') AS file_last_modified_time,\n    datetime(f.ctime, 'unixepoch') AS file_last_status_change_time\n    datetime(f.btime, 'unixepoch') AS file_created_time,\n    f.size AS size_bytes\nFROM\n    file f\nLEFT JOIN\n    users u ON f.uid = u.uid\nLEFT JOIN\n    groups g ON f.gid = g.gid\nWHERE\n    f.path = \"/etc/ld.so.preload\"\n    OR f.path = \"/etc/ld.so.conf\"\n    OR f.path = \"/etc/ld.so.cache\"\n    OR f.path LIKE \"/etc/ld.so.conf.d/%\";\n","SELECT \n    p.pid,\n    p.name AS process_name,\n    p.path AS process_path,\n    p.cmdline AS command_line,\n    pe.key AS env_key,\n    pe.value AS env_value,\n    (strftime('%s', 'now') - p.start_time) AS runtime_seconds\nFROM \n    processes p\nJOIN \n    process_envs pe ON p.pid = pe.pid\nWHERE \n    pe.key IN ('LD_PRELOAD', 'LD_LIBRARY_PATH')\n    AND (strftime('%s', 'now') - p.start_time) > 3600;\n"],"license":"Elastic License v2","description":"This hunt identifies potential persistence mechanisms via dynamic linker hijacking on Linux systems. Attackers can manipulate environment variables like LD_PRELOAD and LD_LIBRARY_PATH to execute malicious shared libraries, hijacking the dynamic linker process for persistence or privilege escalation. This hunt monitors for suspicious usage of these environment variables, the creation of shared library files (.so), and access to critical dynamic linker configuration files.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1574","name":"","reference":"https://attack.mitre.org/techniques/T1574/","subtechnique":[{"id":"T1574.006","reference":"https://attack.mitre.org/techniques/T1574/006/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["endpoint"]}}},"__N_SSG":true}