{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunt identifies processes on Linux systems with specific capabilities set. It monitors process execution events where processes have effective or permitted capabilities, which can be indicative of elevated privileges. The hunt focuses on non-root users to detect potential privilege escalation attempts. The hunt lists detailed information for further analysis and investigation.\n","integration":["endpoint"],"uuid":"6f67704d-e5b1-4613-912c-e2965660fe17","name":"Process Capability Hunting","language":["ES|QL"],"license":"Elastic License v2","notes":["Monitors process execution events where processes have specific capabilities set, such as CAP_SYS_MODULE, CAP_SYS_PTRACE, and others.","Excludes certain processes and capabilities to reduce false positives, but these can be adjusted based on your environment.","Uses EVAL to tag potential privilege escalation events and counts occurrences to identify unusual activity.","Focuses on non-root users to detect potential privilege escalation attempts.","Requires additional data analysis and investigation into results to identify malicious or unauthorized use of process capabilities."],"mitre":["T1548.001","T1548.003"],"query":["from logs-endpoint.events.process-*\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.action == \"exec\" and event.type == \"start\" and (process.thread.capabilities.effective is not null or process.thread.capabilities.permitted is not null) and user.id != \"0\" and\nnot (\n  // Remove these if you expect persistence through capabilities\n  process.executable like \"/var/lib/docker/*\" or\n  process.name == \"gnome-keyring-daemon\" or\n  process.thread.capabilities.permitted == \"CAP_WAKE_ALARM\"\n)\n| stats cc = count(), host_count = count_distinct(host.name) by process.executable, process.thread.capabilities.effective, process.thread.capabilities.permitted\n| where host_count <= 3 and cc < 5\n| sort cc asc\n| limit 100\n","from logs-endpoint.events.process-*\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.action == \"exec\" and event.type == \"start\" and (\n  process.thread.capabilities.effective in (\"CAP_SYS_MODULE\", \"CAP_SYS_PTRACE\", \"CAP_DAC_OVERRIDE\", \"CAP_DAC_READ_SEARCH\", \"CAP_SETUID\", \"CAP_SETGID\", \"CAP_SYS_ADMIN\") or\n  process.thread.capabilities.permitted in (\"CAP_SYS_MODULE\", \"CAP_SYS_PTRACE\", \"CAP_DAC_OVERRIDE\", \"CAP_DAC_READ_SEARCH\", \"CAP_SETUID\", \"CAP_SETGID\", \"CAP_SYS_ADMIN\")\n) and user.id != \"0\"\n| stats cc = count(), host_count = count_distinct(host.name) by process.executable, process.thread.capabilities.effective, process.thread.capabilities.permitted\n| where host_count <= 3 and cc < 5\n| sort cc asc\n| limit 100\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-endpoint.events.process-*\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.action == \"exec\" and event.type == \"start\" and (process.thread.capabilities.effective is not null or process.thread.capabilities.permitted is not null) and user.id != \"0\" and\nnot (\n  // Remove these if you expect persistence through capabilities\n  process.executable like \"/var/lib/docker/*\" or\n  process.name == \"gnome-keyring-daemon\" or\n  process.thread.capabilities.permitted == \"CAP_WAKE_ALARM\"\n)\n| stats cc = count(), host_count = count_distinct(host.name) by process.executable, process.thread.capabilities.effective, process.thread.capabilities.permitted\n| where host_count <= 3 and cc < 5\n| sort cc asc\n| limit 100\n","from logs-endpoint.events.process-*\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.action == \"exec\" and event.type == \"start\" and (\n  process.thread.capabilities.effective in (\"CAP_SYS_MODULE\", \"CAP_SYS_PTRACE\", \"CAP_DAC_OVERRIDE\", \"CAP_DAC_READ_SEARCH\", \"CAP_SETUID\", \"CAP_SETGID\", \"CAP_SYS_ADMIN\") or\n  process.thread.capabilities.permitted in (\"CAP_SYS_MODULE\", \"CAP_SYS_PTRACE\", \"CAP_DAC_OVERRIDE\", \"CAP_DAC_READ_SEARCH\", \"CAP_SETUID\", \"CAP_SETGID\", \"CAP_SYS_ADMIN\")\n) and user.id != \"0\"\n| stats cc = count(), host_count = count_distinct(host.name) by process.executable, process.thread.capabilities.effective, process.thread.capabilities.permitted\n| where host_count <= 3 and cc < 5\n| sort cc asc\n| limit 100\n"],"license":"Elastic License v2","description":"This hunt identifies processes on Linux systems with specific capabilities set. It monitors process execution events where processes have effective or permitted capabilities, which can be indicative of elevated privileges. The hunt focuses on non-root users to detect potential privilege escalation attempts. The hunt lists detailed information for further analysis and investigation.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1548","name":"","reference":"https://attack.mitre.org/techniques/T1548/","subtechnique":[{"id":"T1548.001","reference":"https://attack.mitre.org/techniques/T1548/001/"}]},{"id":"T1548","name":"","reference":"https://attack.mitre.org/techniques/T1548/","subtechnique":[{"id":"T1548.003","reference":"https://attack.mitre.org/techniques/T1548/003/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["endpoint"]}}},"__N_SSG":true}