{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"Leveraging aggregation by process executable entities, this hunt identifies identifies a high number of DNS TXT record queries from same process.\nAdversaries may leverage DNS TXT queries to stage malicious content or exfiltrate data.\n","integration":["endpoint","windows"],"uuid":"7a2c8397-d219-47ad-a8e2-93562e568d08","name":"Suspicious DNS TXT Record Lookups by Process","language":["ES|QL"],"license":"Elastic License v2","notes":["This hunt returns a list of processes unique pids and executable paths that performs a high number of DNS TXT lookups.","Pivoting by `process.entity_id` will allow further investigation (parent process, hash, child processes, other network events etc.)."],"mitre":["T1071","T1071.004"],"query":["from logs-endpoint.events.network-*, logs-windows.sysmon_operational-*\n| where host.os.family == \"windows\" and event.category == \"network\" and\n  event.action in (\"lookup_requested\", \"DNSEvent (DNS query)\") and\n  (dns.question.type == \"TXT\" or dns.answers.type == \"TXT\") and process.executable != \"C:\\\\Windows\\\\system32\\\\svchost.exe\"\n| keep process.executable,  process.entity_id\n| stats occurrences = count(*) by process.entity_id, process.executable\n /* threshold can be adjusted to your env */\n| where occurrences >= 50\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-endpoint.events.network-*, logs-windows.sysmon_operational-*\n| where host.os.family == \"windows\" and event.category == \"network\" and\n  event.action in (\"lookup_requested\", \"DNSEvent (DNS query)\") and\n  (dns.question.type == \"TXT\" or dns.answers.type == \"TXT\") and process.executable != \"C:\\\\Windows\\\\system32\\\\svchost.exe\"\n| keep process.executable,  process.entity_id\n| stats occurrences = count(*) by process.entity_id, process.executable\n /* threshold can be adjusted to your env */\n| where occurrences >= 50\n"],"license":"Elastic License v2","description":"Leveraging aggregation by process executable entities, this hunt identifies identifies a high number of DNS TXT record queries from same process.\nAdversaries may leverage DNS TXT queries to stage malicious content or exfiltrate data.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1071","name":"","reference":"https://attack.mitre.org/techniques/T1071/"},{"id":"T1071","name":"","reference":"https://attack.mitre.org/techniques/T1071/","subtechnique":[{"id":"T1071.004","reference":"https://attack.mitre.org/techniques/T1071/004/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["endpoint","windows"]}}},"__N_SSG":true}