{"pageProps":{"rule":{"metadata":{"creation_date":"2021/04/12","integration":["endpoint","windows","m365_defender","sentinel_one_cloud_funnel"],"maturity":"production","updated_date":"2024/10/15","min_stack_version":"8.14.0","min_stack_comments":"Breaking change at 8.14.0 for the Windows Integration."},"rule":{"author":["Elastic"],"description":"Identifies the modification of the Remote Desktop Protocol (RDP) Shadow registry or the execution of processes\nindicative of an active RDP shadowing session. An adversary may abuse the RDP Shadowing feature to spy on or control\nother users active RDP sessions.\n","from":"now-9m","index":["logs-endpoint.events.process-*","logs-endpoint.events.registry-*","winlogbeat-*","logs-windows.sysmon_operational-*","endgame-*","logs-m365_defender.event-*","logs-sentinel_one_cloud_funnel.*"],"language":"eql","license":"Elastic License v2","name":"Potential Remote Desktop Shadowing Activity","references":["https://bitsadm.in/blog/spying-on-users-using-rdp-shadowing","https://swarm.ptsecurity.com/remote-desktop-services-shadowing/"],"risk_score":73,"rule_id":"c57f8579-e2a5-4804-847f-f2732edc5156","severity":"high","tags":["Domain: Endpoint","OS: Windows","Use Case: Threat Detection","Tactic: Lateral Movement","Data Source: Elastic Endgame","Data Source: Elastic Defend","Data Source: Sysmon","Data Source: Microsoft Defender for Endpoint","Data Source: SentinelOne","Language: eql"],"timestamp_override":"event.ingested","type":"eql","query":"/* Identifies the modification of RDP Shadow registry or\n  the execution of processes indicative of active shadow RDP session */\n\nany where host.os.type == \"windows\" and\n(\n  (event.category == \"registry\" and\n     registry.path : (\n      \"HKLM\\\\Software\\\\Policies\\\\Microsoft\\\\Windows NT\\\\Terminal Services\\\\Shadow\",\n      \"\\\\REGISTRY\\\\MACHINE\\\\Software\\\\Policies\\\\Microsoft\\\\Windows NT\\\\Terminal Services\\\\Shadow\",\n      \"MACHINE\\\\Software\\\\Policies\\\\Microsoft\\\\Windows NT\\\\Terminal Services\\\\Shadow\"\n    )\n  ) or\n  (event.category == \"process\" and event.type == \"start\" and\n     (process.name : (\"RdpSaUacHelper.exe\", \"RdpSaProxy.exe\") and process.parent.name : \"svchost.exe\") or\n     (?process.pe.original_file_name : \"mstsc.exe\" and process.args : \"/shadow:*\")\n  )\n)\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1021","name":"Remote Services","reference":"https://attack.mitre.org/techniques/T1021/","subtechnique":[{"id":"T1021.001","name":"Remote Desktop Protocol","reference":"https://attack.mitre.org/techniques/T1021/001/"}]}],"tactic":{"id":"TA0008","name":"Lateral Movement","reference":"https://attack.mitre.org/tactics/TA0008/"}}]}}},"__N_SSG":true}