{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunt looks for scheduled tasks creation by action using registry events. Scheduled tasks actions are saved under the TaskCache registry key in base64 encoded blob. Malware often abuse LOLBins to proxy execution or run executables from unusual paths, you can add more patterns to the query.\n","integration":["endpoint"],"uuid":"df50f65e-e820-47f4-a039-671611582f51","name":"Scheduled tasks Creation by Action via Registry","language":["ES|QL"],"license":"Elastic License v2","notes":["Malware often abuse LOLBins to proxy execution or run executables from unusual paths, you can add more patterns to the query."],"mitre":["T1053","T1053.005"],"query":["from logs-endpoint.events.registry-*\n| where  @timestamp > now() - 7 day\n| where host.os.type == \"windows\" and event.category == \"registry\" and event.action == \"modification\" and\n  registry.path like \"\"\"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Schedule\\\\TaskCache\\\\Tasks\\\\*Actions*\"\"\"\n /* scheduled task actions are saved under the TaskCache registry key in base64 encoded blob */\n| eval scheduled_task_action = replace(TO_LOWER(FROM_BASE64(registry.data.bytes)), \"\"\"\\u0000\"\"\", \"\")\n /* commonly abused lolbin set to run as a scheduled task */\n| where scheduled_task_action rlike \"\"\".*(users\\\\public\\\\|\\\\appdata\\\\roaming|programdata|powershell.exe|rundll32.exe|regsvr32.exe|mshta.exe|cscript.exe|wscript.exe|cmd.exe|forfiles|msiexec.exe|wmic.exe|msbuild.exe|http|cmstp.exe|msxsl.exe|ie4uinit.exe).*\"\"\" and not scheduled_task_action like \"localsystem*\"\n| keep scheduled_task_action, registry.path, agent.id\n| stats count_agents = count_distinct(agent.id) by scheduled_task_action\n /* helps reduce result to instances limited to one agent */\n| where count_agents == 1\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-endpoint.events.registry-*\n| where  @timestamp > now() - 7 day\n| where host.os.type == \"windows\" and event.category == \"registry\" and event.action == \"modification\" and\n  registry.path like \"\"\"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\Schedule\\\\TaskCache\\\\Tasks\\\\*Actions*\"\"\"\n /* scheduled task actions are saved under the TaskCache registry key in base64 encoded blob */\n| eval scheduled_task_action = replace(TO_LOWER(FROM_BASE64(registry.data.bytes)), \"\"\"\\u0000\"\"\", \"\")\n /* commonly abused lolbin set to run as a scheduled task */\n| where scheduled_task_action rlike \"\"\".*(users\\\\public\\\\|\\\\appdata\\\\roaming|programdata|powershell.exe|rundll32.exe|regsvr32.exe|mshta.exe|cscript.exe|wscript.exe|cmd.exe|forfiles|msiexec.exe|wmic.exe|msbuild.exe|http|cmstp.exe|msxsl.exe|ie4uinit.exe).*\"\"\" and not scheduled_task_action like \"localsystem*\"\n| keep scheduled_task_action, registry.path, agent.id\n| stats count_agents = count_distinct(agent.id) by scheduled_task_action\n /* helps reduce result to instances limited to one agent */\n| where count_agents == 1\n"],"license":"Elastic License v2","description":"This hunt looks for scheduled tasks creation by action using registry events. Scheduled tasks actions are saved under the TaskCache registry key in base64 encoded blob. Malware often abuse LOLBins to proxy execution or run executables from unusual paths, you can add more patterns to the query.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1053","name":"","reference":"https://attack.mitre.org/techniques/T1053/"},{"id":"T1053","name":"","reference":"https://attack.mitre.org/techniques/T1053/","subtechnique":[{"id":"T1053.005","reference":"https://attack.mitre.org/techniques/T1053/005/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["endpoint"]}}},"__N_SSG":true}