{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"Leveraging frequency based analysis and path normalization, this hunt identifies rare instances where a program adds a Startup persistence via file creation. Startup entries cause programs to run each time that a user logs on and are often abused by adversaries to maintain persistence on an endpoint.","integration":["endpoint","windows"],"uuid":"ea950361-33e4-4045-96a5-d36ca28fbc91","name":"Persistence via Startup with Low Occurrence Frequency by Unique Host","language":["ES|QL"],"license":"Elastic License v2","notes":["Elastic Defend file event captures the `process.code_signature` information, this can be added to the hunt to limit to unsigned and Microsoft signed programs.","Unique `file.name` and limited to one agent is not necessarily malicious, however helps surface ones worth further investigation.","Suspicious `process.executable` paths and LOLBins should be reviewed further."],"mitre":["T1547","T1547.001"],"query":["from logs-endpoint.events.file-*, logs-windows.sysmon_operational-default-*\n| where  @timestamp > now() - 7 day\n| where host.os.family == \"windows\" and event.category == \"file\" and event.action in (\"creation\", \"FileCreate\") and\n  file.path rlike \"\"\"(C:\\\\Users\\\\.+\\\\AppData\\\\Roaming\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup\\\\.+*|C:\\\\ProgramData\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\StartUp\\\\.+)\"\"\"\n| keep process.executable, host.id, file.name\n /* Paths normalization in registry.data.strings to ease aggregation */\n| eval process_path = replace(process.executable, \"\"\"([0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}|ns[a-z][A-Z0-9]{3,4}\\.tmp|DX[A-Z0-9]{3,4}\\.tmp|7z[A-Z0-9]{3,5}\\.tmp|[0-9\\.\\-\\_]{3,})\"\"\", \"\")\n| eval process_path = replace(process_path, \"\"\"[cC]:\\\\[uU][sS][eE][rR][sS]\\\\[a-zA-Z0-9\\.\\-\\_\\$~ ]+\\\\\"\"\", \"C:\\\\\\\\users\\\\\\\\user\\\\\\\\\")\n| stats number_hosts = count_distinct(host.id) by process_path, file.name\n| where number_hosts == 1\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-endpoint.events.file-*, logs-windows.sysmon_operational-default-*\n| where  @timestamp > now() - 7 day\n| where host.os.family == \"windows\" and event.category == \"file\" and event.action in (\"creation\", \"FileCreate\") and\n  file.path rlike \"\"\"(C:\\\\Users\\\\.+\\\\AppData\\\\Roaming\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\Startup\\\\.+*|C:\\\\ProgramData\\\\Microsoft\\\\Windows\\\\Start Menu\\\\Programs\\\\StartUp\\\\.+)\"\"\"\n| keep process.executable, host.id, file.name\n /* Paths normalization in registry.data.strings to ease aggregation */\n| eval process_path = replace(process.executable, \"\"\"([0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}|ns[a-z][A-Z0-9]{3,4}\\.tmp|DX[A-Z0-9]{3,4}\\.tmp|7z[A-Z0-9]{3,5}\\.tmp|[0-9\\.\\-\\_]{3,})\"\"\", \"\")\n| eval process_path = replace(process_path, \"\"\"[cC]:\\\\[uU][sS][eE][rR][sS]\\\\[a-zA-Z0-9\\.\\-\\_\\$~ ]+\\\\\"\"\", \"C:\\\\\\\\users\\\\\\\\user\\\\\\\\\")\n| stats number_hosts = count_distinct(host.id) by process_path, file.name\n| where number_hosts == 1\n"],"license":"Elastic License v2","description":"Leveraging frequency based analysis and path normalization, this hunt identifies rare instances where a program adds a Startup persistence via file creation. Startup entries cause programs to run each time that a user logs on and are often abused by adversaries to maintain persistence on an endpoint.","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1547","name":"","reference":"https://attack.mitre.org/techniques/T1547/"},{"id":"T1547","name":"","reference":"https://attack.mitre.org/techniques/T1547/","subtechnique":[{"id":"T1547.001","reference":"https://attack.mitre.org/techniques/T1547/001/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["endpoint","windows"]}}},"__N_SSG":true}