{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunting query identifies when an anonymous user, outside of the known AWS IP ranges, makes multiple `GetObject` requests to a public S3 bucket. Rapid access to objects in a public S3 bucket may indicate an adversary attempting to exfiltrate data or perform reconnaissance on the bucket contents.\n","integration":["aws.cloudtrail"],"uuid":"ef579900-75ef-11ef-b47f-f661ea17fbcc","name":"S3 Public Bucket Rapid Object Access Attempts","language":["ES|QL"],"license":"Elastic License v2","notes":["Use the `bucket_name` field to identify the public S3 bucket that the objects were accessed from","Use the `bucket_object` field to identify the objects that were accessed","Review bucket policies and access control lists (ACLs) to ensure that the bucket is not publicly accessible",""],"mitre":["T1530"],"query":["from logs-aws.cloudtrail*\n| where @timestamp > now() - 7 day\n| where event.provider == \"s3.amazonaws.com\" and event.action == \"GetObject\" and cloud.account.id == \"anonymous\"\n    and NOT CIDR_MATCH(source.ip,\n       \"10.0.0.0/8\", \"172.16.0.0/12\", \"192.168.0.0/16\",\n       \"100.64.0.0/10\", \"169.254.0.0/16\", \"127.0.0.0/8\",\n       \"52.95.0.0/16\",\"54.239.0.0/16\", \"18.0.0.0/8\",\n       \"3.0.0.0/8\", \"35.0.0.0/8\")\n| DISSECT aws.cloudtrail.request_parameters \"{%{?bucket_name_key}=%{bucket_name}, %{?host_key}=%{bucket_location}, %{?object_key}=%{bucket_object}}\"\n| STATS s3_bucket_access_count = COUNT(bucket_object) by bucket_name\n| WHERE s3_bucket_access_count >= 15\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-aws.cloudtrail*\n| where @timestamp > now() - 7 day\n| where event.provider == \"s3.amazonaws.com\" and event.action == \"GetObject\" and cloud.account.id == \"anonymous\"\n    and NOT CIDR_MATCH(source.ip,\n       \"10.0.0.0/8\", \"172.16.0.0/12\", \"192.168.0.0/16\",\n       \"100.64.0.0/10\", \"169.254.0.0/16\", \"127.0.0.0/8\",\n       \"52.95.0.0/16\",\"54.239.0.0/16\", \"18.0.0.0/8\",\n       \"3.0.0.0/8\", \"35.0.0.0/8\")\n| DISSECT aws.cloudtrail.request_parameters \"{%{?bucket_name_key}=%{bucket_name}, %{?host_key}=%{bucket_location}, %{?object_key}=%{bucket_object}}\"\n| STATS s3_bucket_access_count = COUNT(bucket_object) by bucket_name\n| WHERE s3_bucket_access_count >= 15\n"],"license":"Elastic License v2","description":"This hunting query identifies when an anonymous user, outside of the known AWS IP ranges, makes multiple `GetObject` requests to a public S3 bucket. Rapid access to objects in a public S3 bucket may indicate an adversary attempting to exfiltrate data or perform reconnaissance on the bucket contents.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1530","name":"","reference":"https://attack.mitre.org/techniques/T1530/"}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["aws.cloudtrail"]}}},"__N_SSG":true}