{"pageProps":{"rule":{"metadata":{"creation_date":"2023/06/09","integration":["endpoint"],"maturity":"production","min_stack_comments":"New fields added: required_fields, related_integrations, setup, New Term","min_stack_version":"8.6.0","updated_date":"2023/11/02"},"rule":{"author":["Elastic"],"description":"This rule monitors the creation of shared object files by previously unknown processes. The creation of a shared object\nfile involves compiling code into a dynamically linked library that can be loaded by other programs at runtime. While\nthis process is typically used for legitimate purposes, malicious actors can leverage shared object files to execute\nunauthorized code, inject malicious functionality into legitimate processes, or bypass security controls. This allows\nmalware to persist on the system, evade detection, and potentially compromise the integrity and confidentiality of the\naffected system and its data.\n","from":"now-9m","index":["logs-endpoint.events.*","endgame-*"],"language":"kuery","license":"Elastic License v2","name":"Shared Object Created or Changed by Previously Unknown Process","references":["https://threatpost.com/sneaky-malware-backdoors-linux/180158/"],"risk_score":47,"rule_id":"aebaa51f-2a91-4f6a-850b-b601db2293f4","setup":"\nThis rule requires data coming in from Elastic Defend.\n\n### Elastic Defend Integration Setup\nElastic Defend is integrated into the Elastic Agent using Fleet. Upon configuration, the integration allows the Elastic Agent to monitor events on your host and send data to the Elastic Security app.\n\n#### Prerequisite Requirements:\n- Fleet is required for Elastic Defend.\n- To configure Fleet Server refer to the [documentation](https://www.elastic.co/guide/en/fleet/current/fleet-server.html).\n\n#### The following steps should be executed in order to add the Elastic Defend integration on a Linux System:\n- Go to the Kibana home page and click \"Add integrations\".\n- In the query bar, search for \"Elastic Defend\" and select the integration to see more details about it.\n- Click \"Add Elastic Defend\".\n- Configure the integration name and optionally add a description.\n- Select the type of environment you want to protect, either \"Traditional Endpoints\" or \"Cloud Workloads\".\n- Select a configuration preset. Each preset comes with different default settings for Elastic Agent, you can further customize these later by configuring the Elastic Defend integration policy. [Helper guide](https://www.elastic.co/guide/en/security/current/configure-endpoint-integration-policy.html).\n- We suggest selecting \"Complete EDR (Endpoint Detection and Response)\" as a configuration setting, that provides \"All events; all preventions\"\n- Enter a name for the agent policy in \"New agent policy name\". If other agent policies already exist, you can click the \"Existing hosts\" tab and select an existing policy instead.\nFor more details on Elastic Agent configuration settings, refer to the [helper guide](https://www.elastic.co/guide/en/fleet/8.10/agent-policy.html).\n- Click \"Save and Continue\".\n- To complete the integration, select \"Add Elastic Agent to your hosts\" and continue to the next section to install the Elastic Agent on your hosts.\nFor more details on Elastic Defend refer to the [helper guide](https://www.elastic.co/guide/en/security/current/install-endpoint.html).\n\n","severity":"medium","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Persistence","Data Source: Elastic Endgame","Data Source: Elastic Defend"],"timestamp_override":"event.ingested","type":"new_terms","query":"host.os.type:linux and event.action:(creation or file_create_event or file_rename_event or rename) and \nfile.path:(/dev/shm/* or /usr/lib/*) and file.extension:so and \nprocess.name: ( * and not (\"5\" or \"dockerd\" or \"dpkg\" or \"rpm\" or \"snapd\" or \"exe\" or \"yum\" or \"vmis-launcher\"\n  or \"pacman\" or \"apt-get\" or \"dnf\"))\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1574","name":"Hijack Execution Flow","reference":"https://attack.mitre.org/techniques/T1574/","subtechnique":[{"id":"T1574.006","name":"Dynamic Linker Hijacking","reference":"https://attack.mitre.org/techniques/T1574/006/"}]}],"tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"}}],"new_terms":{"field":"new_terms_fields","value":["host.id","file.path","process.executable"],"history_window_start":[{"field":"history_window_start","value":"now-10d"}]}}}},"__N_SSG":true}