{"pageProps":{"rule":{"metadata":{"creation_date":"2020/09/02","integration":["endpoint","windows"],"maturity":"production","min_stack_comments":"New fields added: required_fields, related_integrations, setup","min_stack_version":"8.3.0","updated_date":"2023/12/13"},"rule":{"author":["Elastic"],"description":"Identifies the installation of custom Application Compatibility Shim databases. This Windows functionality has been\nabused by attackers to stealthily gain persistence and arbitrary code execution in legitimate Windows processes.\n","from":"now-9m","index":["logs-endpoint.events.registry*","winlogbeat-*","logs-windows.*"],"language":"eql","license":"Elastic License v2","name":"Installation of Custom Shim Databases","risk_score":47,"rule_id":"c5ce48a6-7f57-4ee8-9313-3d0024caee10","severity":"medium","tags":["Domain: Endpoint","OS: Windows","Use Case: Threat Detection","Tactic: Persistence","Data Source: Elastic Defend"],"timestamp_override":"event.ingested","type":"eql","query":"registry where host.os.type == \"windows\" and event.type in (\"creation\", \"change\") and\n    registry.path : \"HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\AppCompatFlags\\\\Custom\\\\*.sdb\" and \n    not process.executable : \n                       (\"?:\\\\Program Files (x86)\\\\DesktopCentral_Agent\\\\swrepository\\\\1\\\\swuploads\\\\SAP-SLC\\\\SAPSetupSLC02_14-80001954\\\\Setup\\\\NwSapSetup.exe\", \n                        \"?:\\\\$WINDOWS.~BT\\\\Sources\\\\SetupPlatform.exe\", \n                         \"?:\\\\Program Files (x86)\\\\SAP\\\\SAPsetup\\\\setup\\\\NwSapSetup.exe\", \n                         \"?:\\\\Program Files (x86)\\\\SAP\\\\SapSetup\\\\OnRebootSvc\\\\NWSAPSetupOnRebootInstSvc.exe\", \n                         \"?:\\\\Program Files (x86)\\\\Kaspersky Lab\\\\Kaspersky Security for Windows Server\\\\kavfs.exe\")\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546/","subtechnique":[{"id":"T1546.011","name":"Application Shimming","reference":"https://attack.mitre.org/techniques/T1546/011/"}]}],"tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"}}]}}},"__N_SSG":true}