{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunting query identifies rare occurrences of user authentication events for an Okta user whose registered user account email address has a domain that is not commonly seen in the organization. Adversaries may use compromised credentials or tokens to create a new user account with a domain that is not commonly seen in the organization because they do not have access to a valid email address within that domain.\n","integration":["okta"],"uuid":"f3bc68f4-71e9-11ef-952e-f661ea17fbcc","name":"Rare Occurrence of Domain with User Authentication Events","language":["ES|QL"],"license":"Elastic License v2","notes":["Pivot into potential compromised accounts by searching for the `okta.actor.alternate_id` in `okta.target` where `event.action` is `user.lifecycle.create`. This would identify when the user account was created. The `okta.actor.alternate_id` of this event will also be the potential compromised account."],"mitre":["T1078.004"],"query":["from logs-okta*\n| where @timestamp > NOW() - 7 day\n| where\n    // Filter for user authentication events\n    okta.actor.alternate_id is not null\n    and event.action LIKE \"user.authentication*\"\n\n// Extract the top-level domain (TLD) from the user's email address\n| dissect okta.actor.alternate_id \"%{}@%{tld}\"\n\n// Count the number of user authentication events for each TLD\n| stats tld_auth_counts = count(*) by tld\n\n// Filter for TLDs with less than or equal to 5 user authentication events\n| where tld_auth_counts <= 5\n\n// Sort the results by the number of user authentication events in ascending order\n| sort tld_auth_counts asc\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-okta*\n| where @timestamp > NOW() - 7 day\n| where\n    // Filter for user authentication events\n    okta.actor.alternate_id is not null\n    and event.action LIKE \"user.authentication*\"\n\n// Extract the top-level domain (TLD) from the user's email address\n| dissect okta.actor.alternate_id \"%{}@%{tld}\"\n\n// Count the number of user authentication events for each TLD\n| stats tld_auth_counts = count(*) by tld\n\n// Filter for TLDs with less than or equal to 5 user authentication events\n| where tld_auth_counts <= 5\n\n// Sort the results by the number of user authentication events in ascending order\n| sort tld_auth_counts asc\n"],"license":"Elastic License v2","description":"This hunting query identifies rare occurrences of user authentication events for an Okta user whose registered user account email address has a domain that is not commonly seen in the organization. Adversaries may use compromised credentials or tokens to create a new user account with a domain that is not commonly seen in the organization because they do not have access to a valid email address within that domain.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1078","name":"","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[{"id":"T1078.004","reference":"https://attack.mitre.org/techniques/T1078/004/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["okta"]}}},"__N_SSG":true}