{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunting query identifies rapid reset password requests for different users in Okta. Adversaries may attempt to reset passwords for multiple users in rapid succession to gain unauthorized access to accounts or disrupt operations. This query identifies when the source user is different from the target user in reset password events and filters for users with more than 15 reset password attempts.\n","integration":["okta"],"uuid":"c784106e-6ae8-11ef-919d-f661ea17fbcc","name":"Rapid Reset Password Requests for Different Users","language":["ES|QL"],"license":"Elastic License v2","notes":["`okta.actor.alternate_id` is the potentially compromised account","An API access token may have been compromised, where okta.actor.alternate_id reflects the owner","To identify a list of tokens this user created, search for the `okta.actor.alternate_id` where `event.action` is `system.api_token*` which may require a larger time window"],"mitre":["T1098.001"],"query":["from logs-okta.system*\n| where @timestamp > NOW() - 7 day\n\n// Filter for reset password events where the source user is different from the target user\n| where event.dataset == \"okta.system\" and event.action == \"user.account.reset_password\" and source.user.full_name != user.target.full_name\n\n// Extract relevant fields\n| keep @timestamp, okta.actor.alternate_id, okta.debug_context.debug_data.dt_hash, user.target.full_name, okta.outcome.result\n\n// Count the number of reset password attempts for each user\n| stats\n    user_count = count_distinct(user.target.full_name),\n    reset_counts = by okta.actor.alternate_id, source.user.full_name, okta.debug_context.debug_data.dt_hash\n\n// Filter for more than 10 unique users and more than 15 reset password attempts by the source\n| where user_count > 10 and reset_counts > 15\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-okta.system*\n| where @timestamp > NOW() - 7 day\n\n// Filter for reset password events where the source user is different from the target user\n| where event.dataset == \"okta.system\" and event.action == \"user.account.reset_password\" and source.user.full_name != user.target.full_name\n\n// Extract relevant fields\n| keep @timestamp, okta.actor.alternate_id, okta.debug_context.debug_data.dt_hash, user.target.full_name, okta.outcome.result\n\n// Count the number of reset password attempts for each user\n| stats\n    user_count = count_distinct(user.target.full_name),\n    reset_counts = by okta.actor.alternate_id, source.user.full_name, okta.debug_context.debug_data.dt_hash\n\n// Filter for more than 10 unique users and more than 15 reset password attempts by the source\n| where user_count > 10 and reset_counts > 15\n"],"license":"Elastic License v2","description":"This hunting query identifies rapid reset password requests for different users in Okta. Adversaries may attempt to reset passwords for multiple users in rapid succession to gain unauthorized access to accounts or disrupt operations. This query identifies when the source user is different from the target user in reset password events and filters for users with more than 15 reset password attempts.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1098","name":"","reference":"https://attack.mitre.org/techniques/T1098/","subtechnique":[{"id":"T1098.001","reference":"https://attack.mitre.org/techniques/T1098/001/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["okta"]}}},"__N_SSG":true}