{"pageProps":{"rule":{"metadata":{"creation_date":"2020/08/14","integration":["endpoint"],"maturity":"production","min_stack_comments":"New fields added: required_fields, related_integrations, setup","min_stack_version":"8.3.0","updated_date":"2023/10/23"},"rule":{"author":["Elastic"],"description":"Identifies a potential Gatekeeper bypass. In macOS, when applications or programs are downloaded from the internet,\nthere is a quarantine flag set on the file. This attribute is read by Apple's Gatekeeper defense program at execution\ntime. An adversary may disable this attribute to evade defenses.\n","from":"now-9m","index":["auditbeat-*","logs-endpoint.events.*"],"language":"eql","license":"Elastic License v2","name":"Attempt to Remove File Quarantine Attribute","references":["https://www.trendmicro.com/en_us/research/20/k/new-macos-backdoor-connected-to-oceanlotus-surfaces.html","https://ss64.com/osx/xattr.html"],"risk_score":47,"rule_id":"f0b48bbc-549e-4bcf-8ee0-a7a72586c6a7","setup":"\nIf enabling an EQL rule on a non-elastic-agent index (such as beats) for versions <8.2,\nevents will not define `event.ingested` and default fallback for EQL rules was not added until version 8.2.\nHence for this rule to work effectively, users will need to add a custom ingest pipeline to populate\n`event.ingested` to @timestamp.\nFor more details on adding a custom ingest pipeline refer - https://www.elastic.co/guide/en/fleet/current/data-streams-pipeline-tutorial.html\n","severity":"medium","tags":["Domain: Endpoint","OS: macOS","Use Case: Threat Detection","Tactic: Defense Evasion","Data Source: Elastic Defend"],"timestamp_override":"event.ingested","type":"eql","query":"process where host.os.type == \"macos\" and event.type in (\"start\", \"process_started\") and\n  process.name : \"xattr\" and\n  (\n    (process.args : \"com.apple.quarantine\" and process.args : (\"-d\", \"-w\")) or\n    (process.args : \"-c\") or\n    (process.command_line : (\"/bin/bash -c xattr -c *\", \"/bin/zsh -c xattr -c *\", \"/bin/sh -c xattr -c *\"))\n  ) and not process.args_count > 12\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562/","subtechnique":[{"id":"T1562.001","name":"Disable or Modify Tools","reference":"https://attack.mitre.org/techniques/T1562/001/"}]}],"tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"}}]}}},"__N_SSG":true}