{"pageProps":{"rule":{"metadata":{"creation_date":"2020/09/23","integration":["gcp"],"maturity":"production","min_stack_comments":"New fields added: required_fields, related_integrations, setup","min_stack_version":"8.3.0","updated_date":"2023/06/22"},"rule":{"author":["Elastic"],"description":"Identifies the deletion of a subscription in Google Cloud Platform (GCP). In GCP, the publisher-subscriber relationship\n(Pub/Sub) is an asynchronous messaging service that decouples event-producing and event-processing services. A\nsubscription is a named resource representing the stream of messages to be delivered to the subscribing application.\n","false_positives":["    Subscription deletions may be done by a system or network administrator. Verify whether the user email, resource\n    name, and/or hostname should be making changes in your environment. Subscription deletions by unfamiliar users or\n    hosts should be investigated. If known behavior is causing false positives, it can be exempted from the rule.\n    "],"index":["filebeat-*","logs-gcp*"],"language":"kuery","license":"Elastic License v2","name":"GCP Pub/Sub Subscription Deletion","note":"## Setup\n\nThe GCP Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.","references":["https://cloud.google.com/pubsub/docs/overview"],"risk_score":21,"rule_id":"cc89312d-6f47-48e4-a87c-4977bd4633c3","severity":"low","tags":["Domain: Cloud","Data Source: GCP","Data Source: Google Cloud Platform","Use Case: Log Auditing","Tactic: Defense Evasion"],"timestamp_override":"event.ingested","type":"query","query":"event.dataset:gcp.audit and event.action:google.pubsub.v*.Subscriber.DeleteSubscription and event.outcome:success\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1562","name":"Impair Defenses","reference":"https://attack.mitre.org/techniques/T1562/"}],"tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"}}]}}},"__N_SSG":true}