{"pageProps":{"rule":{"metadata":{"creation_date":"2026/02/02","integration":["kubernetes"],"maturity":"production","updated_date":"2026/02/02"},"rule":{"author":["Elastic"],"description":"This rule detects potential endpoint enumeration attempts by a single user and source IP address. By looking for a\ncombination of failed/successful API requests across multiple endpoints and a limited number of documents, this rule\ncan detect automated permission enumeration attempts. This behavior is uncommon for regular Kubernetes clusters.\n","language":"esql","license":"Elastic License v2","name":"Kubernetes Potential Endpoint Permission Enumeration Attempt Detected","references":["https://heilancoos.github.io/research/2025/12/16/kubernetes.html#unauthenticated-api-access"],"risk_score":47,"rule_id":"a337c3f8-e264-4eb4-9998-22669ca52791","severity":"medium","tags":["Data Source: Kubernetes","Domain: Kubernetes","Use Case: Threat Detection","Tactic: Discovery","Language: esql"],"timestamp_override":"event.ingested","type":"esql","query":"from logs-kubernetes.audit_logs-* metadata _id, _index, _version\n| where kubernetes.audit.stage == \"ResponseComplete\" and kubernetes.audit.verb in (\"get\", \"list\", \"watch\", \"create\", \"update\", \"patch\")\n| stats\n  Esql.document_count = count(),\n  Esql.kubernetes_audit_annotations_authorization_k8s_io_decision_count_distinct = count_distinct(`kubernetes.audit.annotations.authorization_k8s_io/decision`),\n  Esql.kubernetes_audit_verb_count_distinct = count_distinct(kubernetes.audit.verb),\n  Esql.kubernetes_audit_requestURI_count_distinct = count_distinct(kubernetes.audit.requestURI),\n  Esql.kubernetes_audit_objectRef_resource_count_distinct = count_distinct(kubernetes.audit.objectRef.resource),\n  \n  Esql.kubernetes_audit_responseStatus_message_values = values(kubernetes.audit.responseStatus.message),\n  Esql.kubernetes_audit_verb_values = values(kubernetes.audit.verb),\n  Esql.kubernetes_audit_responseStatus_code_values = values(kubernetes.audit.responseStatus.code),\n  Esql.kubernetes_audit_objectRef_resource_values = values(kubernetes.audit.objectRef.resource),\n  Esql.kubernetes_audit_objectRef_namespace_values = values(kubernetes.audit.objectRef.namespace),\n  Esql.kubernetes_audit_user_username_values = values(kubernetes.audit.user.username),\n  Esql.kubernetes_audit_user_groups_values = values(kubernetes.audit.user.groups),\n  Esql.kubernetes_audit_requestURI_values = values(kubernetes.audit.requestURI),\n  Esql.kubernetes_audit_userAgent_values = values(kubernetes.audit.userAgent),\n  Esql.data_stream_namespace_values = values(data_stream.namespace)\n  \n  by kubernetes.audit.user.username, kubernetes.audit.sourceIPs\n| where\n  Esql.kubernetes_audit_annotations_authorization_k8s_io_decision_count_distinct == 2 and\n  Esql.kubernetes_audit_requestURI_count_distinct > 5 and\n  Esql.kubernetes_audit_objectRef_resource_count_distinct > 3 and\n  Esql.document_count < 75\n| keep Esql.*, kubernetes.audit.user.username, kubernetes.audit.sourceIPs\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1613","name":"Container and Resource Discovery","reference":"https://attack.mitre.org/techniques/T1613/"}],"tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"}}]}}},"__N_SSG":true}