{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunting query identifies when a user signs in to the AWS Management Console using a federated session and single-factor authentication. Federated sessions are typically used by users who are not directly managed by AWS IAM or have temporary credentials. Single-factor authentication without MFA may indicate a security risk, as MFA adds an additional layer of security to the authentication process. This could also indicate the abuse of STS tokens to bypass MFA requirements.\n","integration":["aws.cloudtrail"],"uuid":"953b1252-5efd-11ef-a997-f661ea17fbce","name":"Signin Single Factor Console Login via Federated Session","language":["ES|QL"],"license":"Elastic License v2","notes":["Use the `aws.cloudtrail.user_identity.type` field to identify the user type making the request. Federated users are typically given temporary credentials to access AWS services.","`aws.cloudtrail.user_identity.session_context.session_issuer.arn` field represents the ARN of the IAM entity that created the federated session. This IAM entity could be compromised and used to create federated sessions."],"mitre":["T1078.004"],"query":["from logs-aws.cloudtrail-*\n| where @timestamp > now() - 7 day\n| where\n    event.provider == \"signin.amazonaws.com\"\n    and event.action == \"GetSigninToken\"\n    and aws.cloudtrail.event_type == \"AwsConsoleSignIn\"\n    and aws.cloudtrail.user_identity.type == \"FederatedUser\"\n| dissect aws.cloudtrail.additional_eventdata \"{%{?mobile_version_key}=%{mobile_version}, %{?mfa_used_key}=%{mfa_used}}\"\n| where mfa_used == \"No\"\n| keep @timestamp, event.provider, event.action, aws.cloudtrail.event_type, aws.cloudtrail.user_identity.type, aws.cloudtrail.additional_eventdata, mobile_version, mfa_used\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-aws.cloudtrail-*\n| where @timestamp > now() - 7 day\n| where\n    event.provider == \"signin.amazonaws.com\"\n    and event.action == \"GetSigninToken\"\n    and aws.cloudtrail.event_type == \"AwsConsoleSignIn\"\n    and aws.cloudtrail.user_identity.type == \"FederatedUser\"\n| dissect aws.cloudtrail.additional_eventdata \"{%{?mobile_version_key}=%{mobile_version}, %{?mfa_used_key}=%{mfa_used}}\"\n| where mfa_used == \"No\"\n| keep @timestamp, event.provider, event.action, aws.cloudtrail.event_type, aws.cloudtrail.user_identity.type, aws.cloudtrail.additional_eventdata, mobile_version, mfa_used\n"],"license":"Elastic License v2","description":"This hunting query identifies when a user signs in to the AWS Management Console using a federated session and single-factor authentication. Federated sessions are typically used by users who are not directly managed by AWS IAM or have temporary credentials. Single-factor authentication without MFA may indicate a security risk, as MFA adds an additional layer of security to the authentication process. This could also indicate the abuse of STS tokens to bypass MFA requirements.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1078","name":"","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[{"id":"T1078.004","reference":"https://attack.mitre.org/techniques/T1078/004/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["aws.cloudtrail"]}}},"__N_SSG":true}