{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunting query identifies when a high frequency of `GetSecretValue` API calls are made to the AWS Secrets Manager service programmatically. The `GetSecretValue` API call retrieves the secret value for a specified secret. High frequency of these calls may indicate an adversary attempting to access sensitive information stored in AWS Secrets Manager via a compromised account or automated tooling.\n","integration":["aws.cloudtrail"],"uuid":"ef244ca0-5e32-11ef-a8d3-f661ea17fbce","name":"Secrets Manager High Frequency of Programmatic GetSecretValue API Calls","language":["ES|QL"],"license":"Elastic License v2","notes":["Use the `secret_value` field to identify the secret value that was accessed by adding it to the `stats` statement","Review the `aws.cloudtrail.user_identity*` fields to identify the user making the requests and their role permissions","`user_agent.name` field can provide additional context on the tool or application making the API calls. If not `aws-sdk` or known application, investigate further.","Review the `source.*` fields for the IP address and geographical location of the request and compare with the user's typical behavior","The `aws.cloudtrail.user_identity.arn` field can provide additional context on the user making the request and their role permissions. Recent changes to role permissions or unusual logins may indicate a compromised account","`user_agent.name` field can provide additional context on the tool or application making the API calls. If not `aws-sdk` or known application, investigate further."],"mitre":["T1555.006"],"query":["from logs-aws.cloudtrail*\n| where @timestamp > now() - 7 day\n| where\n    event.provider == \"secretsmanager.amazonaws.com\"\n    and event.action == \"GetSecretValue\"\n    and user_agent.name not in (\"Chrome\",\"Firefox\",\"Safari\", \"Edge\", \"Brave\", \"Opera\")\n| dissect aws.cloudtrail.request_parameters \"%{}secret:%{secret_value}}\"\n| stats request_counts = count(*) by event.action, aws.cloudtrail.user_identity.arn, source.ip, user_agent.name\n| sort request_counts asc\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-aws.cloudtrail*\n| where @timestamp > now() - 7 day\n| where\n    event.provider == \"secretsmanager.amazonaws.com\"\n    and event.action == \"GetSecretValue\"\n    and user_agent.name not in (\"Chrome\",\"Firefox\",\"Safari\", \"Edge\", \"Brave\", \"Opera\")\n| dissect aws.cloudtrail.request_parameters \"%{}secret:%{secret_value}}\"\n| stats request_counts = count(*) by event.action, aws.cloudtrail.user_identity.arn, source.ip, user_agent.name\n| sort request_counts asc\n"],"license":"Elastic License v2","description":"This hunting query identifies when a high frequency of `GetSecretValue` API calls are made to the AWS Secrets Manager service programmatically. The `GetSecretValue` API call retrieves the secret value for a specified secret. High frequency of these calls may indicate an adversary attempting to access sensitive information stored in AWS Secrets Manager via a compromised account or automated tooling.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1555","name":"","reference":"https://attack.mitre.org/techniques/T1555/","subtechnique":[{"id":"T1555.006","reference":"https://attack.mitre.org/techniques/T1555/006/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["aws.cloudtrail"]}}},"__N_SSG":true}