{"pageProps":{"rule":{"metadata":{"creation_date":"2025/12/16","integration":["github"],"maturity":"production","updated_date":"2025/12/16"},"rule":{"author":["Elastic"],"description":"Detects a high number of repository cloning actions by a single user within a short time frame. Adversaries may\nclone multiple repositories to exfiltrate sensitive data.\n","from":"now-9m","interval":"8m","language":"esql","license":"Elastic License v2","name":"GitHub Exfiltration via High Number of Repository Clones by User","references":["https://www.wiz.io/blog/shai-hulud-2-0-ongoing-supply-chain-attack","https://trigger.dev/blog/shai-hulud-postmortem","https://posthog.com/blog/nov-24-shai-hulud-attack-post-mortem"],"risk_score":47,"rule_id":"19f3674c-f4a1-43bb-a89c-e4c6212275e0","severity":"medium","tags":["Domain: Cloud","Use Case: Threat Detection","Tactic: Exfiltration","Data Source: Github","Language: esql"],"timestamp_override":"event.ingested","type":"esql","query":"from logs-github.audit-* metadata _id, _index, _version\n| where\n  data_stream.dataset == \"github.audit\" and event.type == \"change\" and event.action == \"git.clone\"\n| stats\n  Esql.event_count = COUNT(*),\n  Esql.github_org_values = values(github.org),\n  Esql.github_repo_values = values(github.repo),\n  Esql.github_repository_public_values = values(github.repository_public),\n  Esql.github_token_id_values = values(github.token_id),\n  Esql.github_user_agent_values = values(github.user_agent),\n  Esql.user_name_values = values(user.name),\n  Esql.agent_id_values = values(agent.id),\n  Esql.event_dataset_values = values(event.dataset),\n  Esql.data_stream_namespace_values = values(data_stream.namespace)\n\n  by user.name\n\n| keep Esql.*\n\n| where\n  Esql.event_count >= 25\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1020","name":"Automated Exfiltration","reference":"https://attack.mitre.org/techniques/T1020/"},{"id":"T1567","name":"Exfiltration Over Web Service","reference":"https://attack.mitre.org/techniques/T1567/","subtechnique":[{"id":"T1567.001","name":"Exfiltration to Code Repository","reference":"https://attack.mitre.org/techniques/T1567/001/"}]}],"tactic":{"id":"TA0010","name":"Exfiltration","reference":"https://attack.mitre.org/tactics/TA0010/"}}]}}},"__N_SSG":true}