{"pageProps":{"rule":{"metadata":{"creation_date":"2026/01/07","integration":["endpoint","sentinel_one_cloud_funnel"],"maturity":"production","updated_date":"2026/01/07"},"rule":{"author":["Elastic"],"description":"This rule monitors for the usage of the most common audio recording utilities on unix systems by an uncommon process parent.\nAdversaries may collect audio data from users or systems for a variety of reasons including espionage, credential theft, or reconnaissance.\n","from":"now-9m","index":["logs-endpoint.events.process*","logs-sentinel_one_cloud_funnel.*","endgame-*"],"language":"kuery","license":"Elastic License v2","name":"Linux Audio Recording Activity Detected","risk_score":21,"rule_id":"3ee526ce-1f26-45dd-9358-c23100d1121f","severity":"low","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Collection","Data Source: Elastic Defend","Data Source: Elastic Endgame","Data Source: SentinelOne","Language: kuery"],"timestamp_override":"event.ingested","type":"new_terms","query":"event.category:process and host.os.type:\"linux\" and event.type:\"start\" and event.action:(\"exec\" or \"exec_event\" or \"start\") and (\n  process.name:(\"arecord\" or \"parec\" or \"pw-record\" or \"ecasound\") or\n  (process.name:\"pw-cat\" and process.args:\"-r\") or\n  (process.name:\"ffmpeg\" and process.args:\"-i\")\n) and\nnot process.args:(\"-h\" or \"--help\" or \"--version\")\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1123","name":"Audio Capture","reference":"https://attack.mitre.org/techniques/T1123/"}],"tactic":{"id":"TA0009","name":"Collection","reference":"https://attack.mitre.org/tactics/TA0009/"}}],"new_terms":{"field":"new_terms_fields","value":["agent.id","process.parent.executable"],"history_window_start":[{"field":"history_window_start","value":"now-5d"}]}}}},"__N_SSG":true}