{"pageProps":{"rule":{"metadata":{"creation_date":"2023/11/07","integration":["okta"],"maturity":"production","updated_date":"2024/07/23"},"rule":{"author":["Elastic"],"description":"Detects when a user has started multiple Okta sessions with the same user account and different session IDs. This may\nindicate that an attacker has stolen the user's session cookie and is using it to access the user's account from a\ndifferent location.\n","false_positives":["A user may have multiple sessions open at the same time, such as on a mobile device and a laptop."],"from":"now-30m","index":["filebeat-*","logs-okta*"],"interval":"60m","language":"kuery","license":"Elastic License v2","name":"Multiple Okta Sessions Detected for a Single User","note":"## Setup\n\nThe Okta Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.","references":["https://developer.okta.com/docs/reference/api/system-log/","https://developer.okta.com/docs/reference/api/event-types/","https://www.elastic.co/security-labs/testing-okta-visibility-and-detection-dorothy","https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection"],"risk_score":47,"rule_id":"621e92b6-7e54-11ee-bdc0-f661ea17fbcd","severity":"medium","tags":["Use Case: Identity and Access Audit","Data Source: Okta","Tactic: Lateral Movement"],"timestamp_override":"event.ingested","type":"threshold","query":"event.dataset:okta.system and okta.event_type:user.session.start and okta.authentication_context.external_session_id:*\n    and not (okta.actor.id: okta* or okta.actor.display_name: okta*)\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1550","name":"Use Alternate Authentication Material","reference":"https://attack.mitre.org/techniques/T1550/","subtechnique":[{"id":"T1550.004","name":"Web Session Cookie","reference":"https://attack.mitre.org/techniques/T1550/004/"}]}],"tactic":{"id":"TA0008","name":"Lateral Movement","reference":"https://attack.mitre.org/tactics/TA0008/"}}],"threshold":{"field":["okta.actor.id"],"value":1,"cardinality":[{"field":"okta.authentication_context.external_session_id","value":3}]}}}},"__N_SSG":true}