{"pageProps":{"rule":{"metadata":{"creation_date":"2022/09/13","integration":["kubernetes"],"maturity":"production","updated_date":"2024/05/21"},"rule":{"author":["Elastic"],"description":"This rule detects a request to attach a controller service account to an existing or new pod running in the kube-system\nnamespace. By default, controllers running as part of the API Server utilize admin-equivalent service accounts hosted in\nthe kube-system namespace. Controller service accounts aren't normally assigned to running pods and could indicate\nadversary behavior within the cluster. An attacker that can create or modify pods or pod controllers in the kube-system\nnamespace, can assign one of these admin-equivalent service accounts to a pod and abuse their powerful token to escalate\nprivileges and gain complete cluster control.\n","false_positives":["    Controller service accounts aren't normally assigned to running pods, this is abnormal behavior with very few\n    legitimate use-cases and should result in very few false positives.\n    "],"index":["logs-kubernetes.*"],"language":"kuery","license":"Elastic License v2","name":"Kubernetes Suspicious Assignment of Controller Service Account","note":"## Setup\n\nThe Kubernetes Fleet integration with Audit Logs enabled or similarly structured data is required to be compatible with this rule.","references":["https://www.paloaltonetworks.com/apps/pan/public/downloadResource?pagePath=/content/pan/en_US/resources/whitepapers/kubernetes-privilege-escalation-excessive-permissions-in-popular-platforms"],"risk_score":47,"rule_id":"63c05204-339a-11ed-a261-0242ac120002","severity":"medium","tags":["Data Source: Kubernetes","Tactic: Execution","Tactic: Privilege Escalation","Language: kuery"],"timestamp_override":"event.ingested","type":"query","query":"event.dataset : \"kubernetes.audit_logs\"\n  and kubernetes.audit.annotations.authorization_k8s_io/decision:\"allow\"\n  and kubernetes.audit.verb : \"create\"\n  and kubernetes.audit.objectRef.resource : \"pods\"\n  and kubernetes.audit.objectRef.namespace : \"kube-system\"\n  and kubernetes.audit.requestObject.spec.serviceAccountName:*controller\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[{"id":"T1078.001","name":"Default Accounts","reference":"https://attack.mitre.org/techniques/T1078/001/"}]}],"tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"}}]}}},"__N_SSG":true}