{"pageProps":{"rule":{"metadata":{"creation_date":"2024/10/25","integration":["aws"],"maturity":"production","updated_date":"2024/10/25"},"rule":{"author":["Elastic"],"description":"Identifies when a user has assumed a role using a new MFA device. Users can assume a role to obtain temporary credentials and access AWS resources using the AssumeRole API of AWS Security Token Service (STS). \nWhile a new MFA device is not always indicative of malicious behavior it should be verified as adversaries can use this technique for persistence and privilege escalation.\n","false_positives":["AWS administrators or automated processes might regularly assume roles for legitimate administrative purposes and to perform periodic tasks such as data backups, updates, or deployments."],"index":["filebeat-*","logs-aws.cloudtrail-*"],"language":"kuery","license":"Elastic License v2","name":"AWS STS AssumeRole with New MFA Device","note":"## Setup\n\nThe AWS Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.","references":["https://docs.aws.amazon.com/STS/latest/APIReference/API_AssumeRole.html","https://github.com/RhinoSecurityLabs/cloudgoat/blob/d5863b80afd082d853f2e8df1955c6393695a4da/scenarios/iam_privesc_by_key_rotation/README.md"],"risk_score":21,"rule_id":"a22f566b-5b23-4412-880d-c6c957acd321","severity":"low","tags":["Domain: Cloud","Data Source: AWS","Data Source: Amazon Web Services","Data Source: AWS STS","Use Case: Identity and Access Audit","Tactic: Privilege Escalation","Tactic: Persistence","Tactic: Lateral Movement","Language: kuery"],"timestamp_override":"event.ingested","type":"new_terms","query":"event.dataset:aws.cloudtrail\n    and event.provider:sts.amazonaws.com\n    and event.action:(AssumeRole or AssumeRoleWithSAML or AssumeRoleWithWebIdentity)\n    and event.outcome:success\n    and user.id:* \n    and aws.cloudtrail.flattened.request_parameters.serialNumber:*\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1556","name":"Modify Authentication Process","reference":"https://attack.mitre.org/techniques/T1556/","subtechnique":[{"id":"T1556.006","name":"Multi-Factor Authentication","reference":"https://attack.mitre.org/techniques/T1556/006/"}]}],"tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"}},{"framework":"MITRE ATT&CK","technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548/"}],"tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"}},{"framework":"MITRE ATT&CK","technique":[{"id":"T1550","name":"Use Alternate Authentication Material","reference":"https://attack.mitre.org/techniques/T1550/","subtechnique":[{"id":"T1550.001","name":"Application Access Token","reference":"https://attack.mitre.org/techniques/T1550/001/"}]}],"tactic":{"id":"TA0008","name":"Lateral Movement","reference":"https://attack.mitre.org/tactics/TA0008/"}}],"new_terms":{"field":"new_terms_fields","value":["user.id","aws.cloudtrail.flattened.request_parameters.serialNumber"],"history_window_start":[{"field":"history_window_start","value":"now-10d"}]}}}},"__N_SSG":true}