{"pageProps":{"rule":{"metadata":{"creation_date":"2020/09/21","integration":["gcp"],"maturity":"production","min_stack_comments":"New fields added: required_fields, related_integrations, setup","min_stack_version":"8.3.0","updated_date":"2023/06/22"},"rule":{"author":["Elastic"],"description":"Identifies when a new key is created for a service account in Google Cloud Platform (GCP). A service account is a\nspecial type of account used by an application or a virtual machine (VM) instance, not a person. Applications use\nservice accounts to make authorized API calls, authorized as either the service account itself, or as G Suite or Cloud\nIdentity users through domain-wide delegation. If private keys are not tracked and managed properly, they can present a\nsecurity risk. An adversary may create a new key for a service account in order to attempt to abuse the permissions\nassigned to that account and evade detection.\n","false_positives":["    Service account keys may be created by system administrators. Verify that the configuration change was expected.\n    Exceptions can be added to this rule to filter expected behavior.\n    "],"index":["filebeat-*","logs-gcp*"],"language":"kuery","license":"Elastic License v2","name":"GCP Service Account Key Creation","note":"## Setup\n\nThe GCP Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.","references":["https://cloud.google.com/iam/docs/service-accounts","https://cloud.google.com/iam/docs/creating-managing-service-account-keys"],"risk_score":21,"rule_id":"0e5acaae-6a64-4bbc-adb8-27649c03f7e1","severity":"low","tags":["Domain: Cloud","Data Source: GCP","Data Source: Google Cloud Platform","Use Case: Identity and Access Audit","Tactic: Persistence"],"timestamp_override":"event.ingested","type":"query","query":"event.dataset:gcp.audit and event.action:google.iam.admin.v*.CreateServiceAccountKey and event.outcome:success\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1098","name":"Account Manipulation","reference":"https://attack.mitre.org/techniques/T1098/"}],"tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"}}]}}},"__N_SSG":true}