{"pageProps":{"rule":{"metadata":{"creation_date":"2023/04/11","integration":["endpoint"],"maturity":"production","min_stack_comments":"New fields added: required_fields, related_integrations, setup","min_stack_version":"8.5.0","updated_date":"2023/04/11"},"rule":{"author":["Elastic"],"description":"Identifies instances where a process named 'grep', 'egrep', or 'pgrep' is started on a Linux system with arguments\nrelated to virtual machine (VM) files, such as \"vmdk\", \"vmx\", \"vmxf\", \"vmsd\", \"vmsn\", \"vswp\", \"vmss\", \"nvram\",\nor \"vmem\". These file extensions are associated with VM-related file formats, and their presence in grep command\narguments may indicate that a threat actor is attempting to search for, analyze, or manipulate VM files on the system.\n","from":"now-9m","index":["logs-endpoint.events.*"],"language":"eql","license":"Elastic License v2","name":"ESXI Discovery via Grep","references":["https://www.bleepingcomputer.com/news/security/massive-esxiargs-ransomware-attack-targets-vmware-esxi-servers-worldwide/"],"risk_score":47,"rule_id":"2b662e21-dc6e-461e-b5cf-a6eb9b235ec4","severity":"medium","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Discovery"],"timestamp_override":"event.ingested","type":"eql","query":"process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and\nprocess.name : (\"grep\", \"egrep\", \"pgrep\") and\nprocess.args : (\"vmdk\", \"vmx\", \"vmxf\", \"vmsd\", \"vmsn\", \"vswp\", \"vmss\", \"nvram\", \"vmem\")\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1518","name":"Software Discovery","reference":"https://attack.mitre.org/techniques/T1518/"}],"tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"}}]}}},"__N_SSG":true}