{"pageProps":{"rule":{"metadata":{"creation_date":"2020/08/24","integration":["endpoint","windows"],"maturity":"production","min_stack_comments":"New fields added: required_fields, related_integrations, setup","min_stack_version":"8.3.0","updated_date":"2023/06/22"},"rule":{"author":["Elastic"],"description":"A suspicious Endpoint Security parent process was detected. This may indicate a process hollowing or other form of code\ninjection.\n","from":"now-9m","index":["winlogbeat-*","logs-endpoint.events.*","logs-windows.*","endgame-*"],"language":"eql","license":"Elastic License v2","name":"Suspicious Endpoint Security Parent Process","note":"## Setup\n\nIf enabling an EQL rule on a non-elastic-agent index (such as beats) for versions <8.2, events will not define `event.ingested` and default fallback for EQL rules was not added until 8.2, so you will need to add a custom pipeline to populate `event.ingested` to @timestamp for this rule to work.\n","risk_score":47,"rule_id":"b41a13c6-ba45-4bab-a534-df53d0cfed6a","severity":"medium","tags":["Domain: Endpoint","OS: Windows","Use Case: Threat Detection","Tactic: Defense Evasion","Data Source: Elastic Endgame"],"timestamp_override":"event.ingested","type":"eql","query":"process where host.os.type == \"windows\" and event.type == \"start\" and\n process.name : (\"esensor.exe\", \"elastic-endpoint.exe\") and\n process.parent.executable != null and\n  /* add FPs here */\n not process.parent.executable : (\"C:\\\\Program Files\\\\Elastic\\\\*\",\n                                  \"C:\\\\Windows\\\\System32\\\\services.exe\",\n                                  \"C:\\\\Windows\\\\System32\\\\WerFault*.exe\",\n                                  \"C:\\\\Windows\\\\System32\\\\wermgr.exe\")\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036/"}],"tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"}}]}}},"__N_SSG":true}