{"pageProps":{"rule":{"metadata":{"creation_date":"2023/03/20","integration":["endpoint"],"maturity":"production","min_stack_comments":"New fields added: required_fields, related_integrations, setup","min_stack_version":"8.3.0","updated_date":"2023/08/02"},"rule":{"author":["Elastic"],"description":"This rule identifies a sequence of a mass file encryption event in conjunction with the creation of a .txt file with \na file name containing ransomware keywords executed by the same process in a 1 second timespan. Ransomware is a type of\nmalware that encrypts a victim's files or systems and demands payment (usually in cryptocurrency) in exchange for the\ndecryption key. One important indicator of a ransomware attack is the mass encryption of the file system, after which a\nnew file extension is added to the file. \n","from":"now-9m","index":["logs-endpoint.events.*"],"language":"eql","license":"Elastic License v2","name":"Potential Linux Ransomware Note Creation Detected","risk_score":47,"rule_id":"c8935a8b-634a-4449-98f7-bb24d3b2c0af","severity":"medium","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Impact"],"type":"eql","query":"sequence by host.id, process.entity_id with maxspan=1s \n  [ file where host.os.type == \"linux\" and event.type == \"change\" and\n    event.action == \"rename\" and file.extension != \"\" and \n    file.path : (\n      \"/home/*\", \"/etc/*\", \"/root/*\", \"/opt/*\", \"/var/backups/*\", \"/var/lib/log/*\"\n      ) and not \n    file.extension : (\n      \"xml\", \"json\", \"conf\", \"dat\", \"gz\", \"info\", \"mod\", \"final\",\n      \"php\", \"pyc\", \"log\", \"bak\", \"bin\", \"csv\", \"pdf\", \"cfg\", \"*old\"\n      ) and not \n    process.name : (\n      \"dpkg\",  \"yum\", \"dnf\", \"rpm\", \"dockerd\"\n      ) ] with runs=100\n  [ file where host.os.type == \"linux\" and event.action == \"creation\" and file.extension == \"txt\" and \n    file.name : (\n      \"*crypt*\", \"*restore*\", \"*lock*\", \"*recovery*\", \"*data*\", \n      \"*read*\", \"*instruction*\", \"*how_to*\", \"*ransom*\"\n      ) and not process.name : (\"go\", \"java\", \"pip*\", \"python*\", \"node\", \"containerd\") ] | tail 1\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1486","name":"Data Encrypted for Impact","reference":"https://attack.mitre.org/techniques/T1486/"}],"tactic":{"id":"TA0040","name":"Impact","reference":"https://attack.mitre.org/tactics/TA0040/"}}]}}},"__N_SSG":true}