{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunt identifies potential persistence mechanisms leveraging Pluggable Authentication Modules (PAM) on Linux systems. PAM is a powerful framework for managing authentication-related tasks, but its flexibility can be abused by attackers to introduce malicious modules or modify configurations to gain unauthorized access or establish persistence. This hunt monitors for modifications to PAM-related files, directories, and modules.\n","integration":["endpoint"],"uuid":"2a3c46b8-7bd6-4bc4-a4a8-a1af114ea152","name":"Persistence via Pluggable Authentication Modules (PAM)","language":["ES|QL","SQL"],"license":"Elastic License v2","notes":["PAM modules are critical to Linux authentication workflows, but they can be abused to establish persistence or execute malicious actions.","This hunt identifies suspicious file creation or modification events in PAM directories, such as /etc/pam.d/, /lib/security/, and related paths.","Uses ES|QL queries to track file events and identify potentially malicious activity based on process activity and file paths.","Complemented by OSQuery queries to provide detailed file metadata for modified PAM-related files, including timestamps and ownership information."],"mitre":["T1556.003"],"query":["from logs-endpoint.events.file-*\n| keep @timestamp, host.os.type, event.type, event.action, file.path, process.executable, agent.id\n| where @timestamp > now() - 7 days\n| where host.os.type == \"linux\" and event.action in (\"rename\", \"creation\") and (\n  file.path like \"/lib/security/*\" or\n  file.path like \"/lib64/security/*\" or\n  file.path like \"/usr/lib64/security/*\" or\n  file.path like \"/usr/lib/x86_64-linux-gnu/security/*\" or\n  file.path like \"/lib/x86_64-linux-gnu/security/*\" or\n  file.path like \"/etc/pam.d/*\" or\n  file.path == \"/etc/pam.conf\"\n)\n| stats cc = count(), agent_count = count_distinct(agent.id) by file.path, process.executable\n| where agent_count <= 3\n| sort cc asc\n| limit 100\n","SELECT\n    f.filename,\n    f.path,\n    u.username AS file_owner,\n    g.groupname AS group_owner,\n    datetime(f.atime, 'unixepoch') AS file_last_access_time,\n    datetime(f.mtime, 'unixepoch') AS file_last_modified_time,\n    datetime(f.ctime, 'unixepoch') AS file_last_status_change_time\n    datetime(f.btime, 'unixepoch') AS file_created_time,\n    f.size AS size_bytes\nFROM\n    file f\nLEFT JOIN\n    users u ON f.uid = u.uid\nLEFT JOIN\n    groups g ON f.gid = g.gid\nWHERE\n    f.path LIKE '/lib/security/%'\n    OR f.path LIKE '/lib64/security/%'\n    OR f.path LIKE '/usr/lib/security/%'\n    OR f.path LIKE '/usr/lib64/security/%'\n    OR f.path LIKE '/usr/lib/x86_64-linux-gnu/security/%'\n    OR f.path LIKE '/lib/x86_64-linux-gnu/security/%'\n    OR f.path like '/etc/pam.d/%'\n    OR f.path = '/etc/pam.conf'\n","SELECT * FROM file\nWHERE (\n       path LIKE '/lib/security/%'\n       OR path LIKE '/lib64/security/%'\n       OR path LIKE '/usr/lib/security/%'\n       OR path LIKE '/usr/lib64/security/%'\n       OR path LIKE '/usr/lib/x86_64-linux-gnu/security/%'\n       OR path LIKE '/lib/x86_64-linux-gnu/security/%'\n       OR path like '/etc/pam.d/%'\n       OR path = '/etc/pam.conf'\n     )\nAND (mtime > strftime('%s', 'now') - (7 * 86400)); -- Modified in the last 7 days\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-endpoint.events.file-*\n| keep @timestamp, host.os.type, event.type, event.action, file.path, process.executable, agent.id\n| where @timestamp > now() - 7 days\n| where host.os.type == \"linux\" and event.action in (\"rename\", \"creation\") and (\n  file.path like \"/lib/security/*\" or\n  file.path like \"/lib64/security/*\" or\n  file.path like \"/usr/lib64/security/*\" or\n  file.path like \"/usr/lib/x86_64-linux-gnu/security/*\" or\n  file.path like \"/lib/x86_64-linux-gnu/security/*\" or\n  file.path like \"/etc/pam.d/*\" or\n  file.path == \"/etc/pam.conf\"\n)\n| stats cc = count(), agent_count = count_distinct(agent.id) by file.path, process.executable\n| where agent_count <= 3\n| sort cc asc\n| limit 100\n","SELECT\n    f.filename,\n    f.path,\n    u.username AS file_owner,\n    g.groupname AS group_owner,\n    datetime(f.atime, 'unixepoch') AS file_last_access_time,\n    datetime(f.mtime, 'unixepoch') AS file_last_modified_time,\n    datetime(f.ctime, 'unixepoch') AS file_last_status_change_time\n    datetime(f.btime, 'unixepoch') AS file_created_time,\n    f.size AS size_bytes\nFROM\n    file f\nLEFT JOIN\n    users u ON f.uid = u.uid\nLEFT JOIN\n    groups g ON f.gid = g.gid\nWHERE\n    f.path LIKE '/lib/security/%'\n    OR f.path LIKE '/lib64/security/%'\n    OR f.path LIKE '/usr/lib/security/%'\n    OR f.path LIKE '/usr/lib64/security/%'\n    OR f.path LIKE '/usr/lib/x86_64-linux-gnu/security/%'\n    OR f.path LIKE '/lib/x86_64-linux-gnu/security/%'\n    OR f.path like '/etc/pam.d/%'\n    OR f.path = '/etc/pam.conf'\n","SELECT * FROM file\nWHERE (\n       path LIKE '/lib/security/%'\n       OR path LIKE '/lib64/security/%'\n       OR path LIKE '/usr/lib/security/%'\n       OR path LIKE '/usr/lib64/security/%'\n       OR path LIKE '/usr/lib/x86_64-linux-gnu/security/%'\n       OR path LIKE '/lib/x86_64-linux-gnu/security/%'\n       OR path like '/etc/pam.d/%'\n       OR path = '/etc/pam.conf'\n     )\nAND (mtime > strftime('%s', 'now') - (7 * 86400)); -- Modified in the last 7 days\n"],"license":"Elastic License v2","description":"This hunt identifies potential persistence mechanisms leveraging Pluggable Authentication Modules (PAM) on Linux systems. PAM is a powerful framework for managing authentication-related tasks, but its flexibility can be abused by attackers to introduce malicious modules or modify configurations to gain unauthorized access or establish persistence. This hunt monitors for modifications to PAM-related files, directories, and modules.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1556","name":"","reference":"https://attack.mitre.org/techniques/T1556/","subtechnique":[{"id":"T1556.003","reference":"https://attack.mitre.org/techniques/T1556/003/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["endpoint"]}}},"__N_SSG":true}