{"pageProps":{"rule":{"metadata":{"creation_date":"2021/01/04","integration":["endpoint"],"maturity":"production","min_stack_comments":"New fields added: required_fields, related_integrations, setup","min_stack_version":"8.3.0","updated_date":"2023/06/22"},"rule":{"author":["Elastic"],"description":"Identifies suspicious child processes of frequently targeted Microsoft Office applications (Word, PowerPoint, and\nExcel). These child processes are often launched during exploitation of Office applications or by documents with\nmalicious macros.\n","from":"now-9m","index":["logs-endpoint.events.*"],"language":"eql","license":"Elastic License v2","name":"Suspicious macOS MS Office Child Process","references":["https://blog.malwarebytes.com/cybercrime/2017/02/microsoft-office-macro-malware-targets-macs/"],"risk_score":47,"rule_id":"66da12b1-ac83-40eb-814c-07ed1d82b7b9","severity":"medium","tags":["Domain: Endpoint","OS: macOS","Use Case: Threat Detection","Tactic: Initial Access"],"timestamp_override":"event.ingested","type":"eql","query":"process where host.os.type == \"macos\" and event.type in (\"start\", \"process_started\") and\n process.parent.name:(\"Microsoft Word\", \"Microsoft PowerPoint\", \"Microsoft Excel\") and\n process.name:\n (\n   \"bash\",\n   \"dash\",\n   \"sh\",\n   \"tcsh\",\n   \"csh\",\n   \"zsh\",\n   \"ksh\",\n   \"fish\",\n   \"python*\",\n   \"perl*\",\n   \"php*\",\n   \"osascript\",\n   \"pwsh\",\n   \"curl\",\n   \"wget\",\n   \"cp\",\n   \"mv\",\n   \"base64\",\n   \"launchctl\"\n  ) and\n  /* noisy false positives related to product version discovery and office errors reporting */\n  not process.args:\n    (\n      \"ProductVersion\",\n      \"hw.model\",\n      \"ioreg\",\n      \"ProductName\",\n      \"ProductUserVisibleVersion\",\n      \"ProductBuildVersion\",\n      \"/Library/Application Support/Microsoft/MERP*/Microsoft Error Reporting.app/Contents/MacOS/Microsoft Error Reporting\"\n    )\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1566","name":"Phishing","reference":"https://attack.mitre.org/techniques/T1566/","subtechnique":[{"id":"T1566.001","name":"Spearphishing Attachment","reference":"https://attack.mitre.org/techniques/T1566/001/"}]}],"tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"}}]}}},"__N_SSG":true}