{"pageProps":{"rule":{"metadata":{"creation_date":"2023/04/11","integration":["endpoint"],"maturity":"production","min_stack_comments":"New fields added: required_fields, related_integrations, setup","min_stack_version":"8.5.0","updated_date":"2023/04/11"},"rule":{"author":["Elastic"],"description":"Identifies instances where VMware-related files, such as those with extensions like \".vmdk\", \".vmx\", \".vmxf\", \".vmsd\",\n\".vmsn\", \".vswp\", \".vmss\", \".nvram\", and \".vmem\", are renamed on a Linux system. The rule monitors for the \"rename\"\nevent action associated with these file types, which could indicate malicious activity.\n","from":"now-9m","index":["logs-endpoint.events.*"],"language":"eql","license":"Elastic License v2","name":"Suspicious Renaming of ESXI Files","references":["https://www.bleepingcomputer.com/news/security/massive-esxiargs-ransomware-attack-targets-vmware-esxi-servers-worldwide/"],"risk_score":47,"rule_id":"97db8b42-69d8-4bf3-9fd4-c69a1d895d68","severity":"medium","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Defense Evasion"],"timestamp_override":"event.ingested","type":"eql","query":"file where host.os.type == \"linux\" and event.action == \"rename\" and\nfile.Ext.original.name : (\"*.vmdk\", \"*.vmx\", \"*.vmxf\", \"*.vmsd\", \"*.vmsn\", \"*.vswp\", \"*.vmss\", \"*.nvram\", \"*.vmem\")\nand not file.name : (\"*.vmdk\", \"*.vmx\", \"*.vmxf\", \"*.vmsd\", \"*.vmsn\", \"*.vswp\", \"*.vmss\", \"*.nvram\", \"*.vmem\")\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1036","name":"Masquerading","reference":"https://attack.mitre.org/techniques/T1036/","subtechnique":[{"id":"T1036.003","name":"Rename System Utilities","reference":"https://attack.mitre.org/techniques/T1036/003/"}]}],"tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"}}]}}},"__N_SSG":true}