{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunt identifies potential persistence mechanisms leveraging PolicyKit (Polkit) on Linux systems. PolicyKit is a system service used to manage system-wide privileges and is often targeted by attackers to escalate privileges or maintain persistence. By monitoring file creations and modifications in key PolicyKit directories and analyzing metadata for Polkit-related files, this hunt helps detect unauthorized changes or suspicious activities that may indicate malicious use of PolicyKit. It provides detailed insights into potentially compromised PolicyKit configurations, enabling analysts to identify and respond to this persistence technique.\n","integration":["endpoint"],"uuid":"4e8a17d3-9139-4b45-86d5-79e8d1eba71e","name":"Persistence via PolicyKit","language":["ES|QL","SQL"],"license":"Elastic License v2","notes":["Tracks file creations and modifications in PolicyKit-related directories such as `/etc/polkit-1/rules.d/`, `/usr/share/polkit-1/rules.d/`, `/usr/share/polkit-1/actions/`, and others to detect unauthorized additions or tampering.","Retrieves metadata for PolicyKit configuration files, including ownership, last access times, and modification timestamps, to identify unauthorized or suspicious changes.","Focuses on recent file modifications within the last 7 days to provide timely detection of potential malicious activities.","Helps detect rare or anomalous file modifications by correlating process execution with file activities, enabling analysts to identify subtle signs of compromise."],"mitre":["T1543"],"query":["sql\nfrom logs-endpoint.events.file-*\n| keep @timestamp, host.os.type, event.type, event.action, file.path, file.extension, process.name, process.executable, agent.id\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.type in (\"creation\", \"change\") and (\n  file.path like \"/etc/polkit-1/rules.d/*\" or\n  file.path like \"/usr/share/polkit-1/rules.d/*\" or\n  file.path like \"/usr/share/polkit-1/actions/*\" or\n  file.path like \"/etc/polkit-1/localauthority/*\" or\n  file.path like \"/var/lib/polkit-1/localauthority/*\"\n) and not (\n  file.extension in (\"swp\", \"dpkg-new\") or\n  process.name in (\"dnf\", \"yum\", \"dpkg\")\n)\n| stats cc = count(), agent_count = count_distinct(agent.id) by file.path, process.executable\n| where agent_count <= 3\n| sort cc asc\n| limit 100\n","sql\nSELECT\n    f.filename,\n    f.path,\n    u.username AS file_owner,\n    g.groupname AS group_owner,\n    datetime(f.atime, 'unixepoch') AS file_last_access_time,\n    datetime(f.mtime, 'unixepoch') AS file_last_modified_time,\n    datetime(f.ctime, 'unixepoch') AS file_last_status_change_time,\n    datetime(f.btime, 'unixepoch') AS file_created_time,\n    f.size AS size_bytes\nFROM\n    file f\nLEFT JOIN\n    users u ON f.uid = u.uid\nLEFT JOIN\n    groups g ON f.gid = g.gid\nWHERE (\n        f.path = '/etc/polkit-1/rules.d/%'\n        OR f.path LIKE '/usr/share/polkit-1/rules.d/%'\n        OR f.path LIKE '/usr/share/polkit-1/actions/%'\n        OR f.path LIKE '/etc/polkit-1/localauthority/%%'\n        OR f.path LIKE '/var/lib/polkit-1/localauthority/%%'\n      )\nAND (mtime > strftime('%s', 'now') - (7 * 86400)); -- Modified in the last 7 days\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["sql\nfrom logs-endpoint.events.file-*\n| keep @timestamp, host.os.type, event.type, event.action, file.path, file.extension, process.name, process.executable, agent.id\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.type in (\"creation\", \"change\") and (\n  file.path like \"/etc/polkit-1/rules.d/*\" or\n  file.path like \"/usr/share/polkit-1/rules.d/*\" or\n  file.path like \"/usr/share/polkit-1/actions/*\" or\n  file.path like \"/etc/polkit-1/localauthority/*\" or\n  file.path like \"/var/lib/polkit-1/localauthority/*\"\n) and not (\n  file.extension in (\"swp\", \"dpkg-new\") or\n  process.name in (\"dnf\", \"yum\", \"dpkg\")\n)\n| stats cc = count(), agent_count = count_distinct(agent.id) by file.path, process.executable\n| where agent_count <= 3\n| sort cc asc\n| limit 100\n","sql\nSELECT\n    f.filename,\n    f.path,\n    u.username AS file_owner,\n    g.groupname AS group_owner,\n    datetime(f.atime, 'unixepoch') AS file_last_access_time,\n    datetime(f.mtime, 'unixepoch') AS file_last_modified_time,\n    datetime(f.ctime, 'unixepoch') AS file_last_status_change_time,\n    datetime(f.btime, 'unixepoch') AS file_created_time,\n    f.size AS size_bytes\nFROM\n    file f\nLEFT JOIN\n    users u ON f.uid = u.uid\nLEFT JOIN\n    groups g ON f.gid = g.gid\nWHERE (\n        f.path = '/etc/polkit-1/rules.d/%'\n        OR f.path LIKE '/usr/share/polkit-1/rules.d/%'\n        OR f.path LIKE '/usr/share/polkit-1/actions/%'\n        OR f.path LIKE '/etc/polkit-1/localauthority/%%'\n        OR f.path LIKE '/var/lib/polkit-1/localauthority/%%'\n      )\nAND (mtime > strftime('%s', 'now') - (7 * 86400)); -- Modified in the last 7 days\n"],"license":"Elastic License v2","description":"This hunt identifies potential persistence mechanisms leveraging PolicyKit (Polkit) on Linux systems. PolicyKit is a system service used to manage system-wide privileges and is often targeted by attackers to escalate privileges or maintain persistence. By monitoring file creations and modifications in key PolicyKit directories and analyzing metadata for Polkit-related files, this hunt helps detect unauthorized changes or suspicious activities that may indicate malicious use of PolicyKit. It provides detailed insights into potentially compromised PolicyKit configurations, enabling analysts to identify and respond to this persistence technique.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1543","name":"","reference":"https://attack.mitre.org/techniques/T1543/"}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["endpoint"]}}},"__N_SSG":true}