{"pageProps":{"rule":{"metadata":{"creation_date":"2025/01/07","integration":["endpoint"],"maturity":"production","updated_date":"2025/12/24"},"rule":{"author":["Elastic"],"building_block_type":"default","description":"This rule identifies Linux system information discovery via the \"getconf\" command. The \"getconf\" command is used to query system configuration\nvariables and system limits. Adversaries may use this command to gather information about the system, such as the page size, maximum number\nof open files, and other system limits, to aid in further exploration and exploitation of the system.\n","from":"now-119m","index":["logs-endpoint.events.process*"],"interval":"60m","language":"kuery","license":"Elastic License v2","name":"Linux System Information Discovery via Getconf","references":["https://blog.exatrack.com/Perfctl-using-portainer-and-new-persistences/"],"risk_score":21,"rule_id":"90e5976d-ed8c-489a-a293-bfc57ff8ba89","severity":"low","tags":["Domain: Endpoint","OS: Linux","Use Case: Threat Detection","Tactic: Discovery","Rule Type: BBR","Data Source: Elastic Defend","Language: kuery"],"timestamp_override":"event.ingested","type":"new_terms","query":"event.category:process and host.os.type:linux and event.type:start and event.action:exec and process.name:getconf and not (\n  process.parent.executable:(\n    \"/usr/bin/google_guest_agent_manager\" or \"/opt/commvault/Base64/cvlaunchd\" or /usr/local/manageengine/uems_agent/bin/*\n  ) or\n  process.working_directory:(\n    \"/opt/oracle/mgmt_agent/agent_inst/bin\" or \"/var/lib/oracle-cloud-agent/plugins/oci-managementagent/polaris\" or\n    \"/opt/commvault/Base/cvlaunchd\" or \"/opt/simpana\" or \"/opt/commvault\" or \"/opt/ITSPlatform/agentcore\" or\n    \"/u01/app/oracle/EMBase/agent_inst/sysman/emd\" or \"/opt/abacus/lib\"\n  ) or\n  process.parent.args:(\n    /opt/oracle/mgmt_agent/agent_inst/* or \"/opt/datadog-agent/bin/agent/agent\" or \"/usr/bin/byobu-status\" or\n    \"/usr/local/nagios/libexec/check_ssl_cert\" or \"/usr/lib64/nagios/plugins/cpanel/check_ssl_cert\"\n  ) or\n  process.parent.command_line:(\n    \"/bin/sh -s unix:cmd\" or \"ruby /usr/local/bundle/bin/bundle exec rackup\"\n  )\n)\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1082","name":"System Information Discovery","reference":"https://attack.mitre.org/techniques/T1082/"}],"tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"}}],"new_terms":{"field":"new_terms_fields","value":["process.parent.executable"],"history_window_start":[{"field":"history_window_start","value":"now-5d"}]}}}},"__N_SSG":true}