{"pageProps":{"rule":{"metadata":{"creation_date":"2026/01/21","integration":["cloud_defend"],"maturity":"production","min_stack_comments":"Defend for Containers integration was re-introduced in 9.3.0","min_stack_version":"9.3.0","updated_date":"2026/01/21"},"rule":{"author":["Elastic"],"description":"This rule detects the reading of the service account token or certificate inside a container. The service account\ntoken or certificate is used to authenticate the container to the Kubernetes API server, and may be used by an\nadversary to gain access to the Kubernetes API server or other resources within the cluster. These files are a\ncommon target for adversaries to gain access to the cluster.\n","false_positives":["    There is a potential for false positives if the service account token or certificate is used for legitimate purposes,\n    such as debugging or troubleshooting. It is important to investigate any alerts generated by this rule to determine\n    if they are indicative of malicious activity or part of legitimate container activity.\n    "],"from":"now-6m","index":["logs-cloud_defend.file*"],"interval":"5m","language":"eql","license":"Elastic License v2","name":"Service Account Token or Certificate Read Detected via Defend for Containers","risk_score":47,"rule_id":"66229f32-c460-410d-bc37-4b32322cd4bb","severity":"medium","tags":["Data Source: Elastic Defend for Containers","Domain: Container","OS: Linux","Use Case: Threat Detection","Tactic: Credential Access","Language: eql"],"timestamp_override":"event.ingested","type":"eql","query":"file where host.os.type == \"linux\" and event.type == \"change\" and event.action == \"open\" and file.path in (\n  \"/var/run/secrets/kubernetes.io/serviceaccount/token\", \"/var/run/secrets/kubernetes.io/serviceaccount/ca.crt\"\n) and\nprocess.interactive == true and container.id like \"*\"\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1552","name":"Unsecured Credentials","reference":"https://attack.mitre.org/techniques/T1552/","subtechnique":[{"id":"T1552.001","name":"Credentials In Files","reference":"https://attack.mitre.org/techniques/T1552/001/"}]}],"tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"}}]}}},"__N_SSG":true}