{"pageProps":{"rule":{"metadata":{"creation_date":"2026/01/21","integration":["cloud_defend"],"maturity":"production","min_stack_comments":"Defend for Containers integration was re-introduced in 9.3.0","min_stack_version":"9.3.0","updated_date":"2026/01/21"},"rule":{"author":["Elastic"],"description":"This rule detects the execution of DNS enumeration tools inside a container. DNS enumeration tools are used to\nenumerate the DNS servers and domains of the container, which can be used by an adversary to gain information about\nthe network configuration of the container and the services running inside it.\n","false_positives":["    There is a potential for false positives if the DNS enumeration tools are used for legitimate purposes,\n    such as debugging or troubleshooting. It is important to investigate any alerts generated by this rule to determine\n    if they are indicative of malicious activity or part of legitimate container activity.\n    "],"from":"now-6m","index":["logs-cloud_defend.process*"],"interval":"5m","language":"eql","license":"Elastic License v2","name":"DNS Enumeration Detected via Defend for Containers","risk_score":21,"rule_id":"74ee9a2d-5ed3-40c8-9e6c-523d2e6a17ef","severity":"low","tags":["Data Source: Elastic Defend for Containers","Domain: Container","OS: Linux","Use Case: Threat Detection","Tactic: Discovery","Language: eql"],"timestamp_override":"event.ingested","type":"eql","query":"process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and\nprocess.interactive == true and container.id like \"*\" and \n(\n  /* getent hosts is often used without a target arg */\n  (process.name == \"getent\" and process.args == \"hosts\") or\n\n  /* explicit DNS query tools */\n  (\n    process.name in (\"nslookup\", \"dig\", \"host\") or\n    (\n      /* Account for tools that execute utilities as a subprocess, in this case the target utility name will appear as a process arg */\n      process.name in (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\", \"busybox\") and\n      process.args in (\n        \"nslookup\", \"/bin/nslookup\", \"/usr/bin/nslookup\", \"/usr/local/bin/nslookup\",\n        \"dig\", \"/bin/dig\", \"/usr/bin/dig\", \"/usr/local/bin/dig\",\n        \"host\", \"/bin/host\", \"/usr/bin/host\", \"/usr/local/bin/host\"\n      ) and\n      /* default exclusion list to not FP on default multi-process commands */\n      not process.args in (\n        \"which\", \"/bin/which\", \"/usr/bin/which\", \"/usr/local/bin/which\",\n        \"man\", \"/bin/man\", \"/usr/bin/man\", \"/usr/local/bin/man\",\n        \"chmod\", \"/bin/chmod\", \"/usr/bin/chmod\", \"/usr/local/bin/chmod\",\n        \"chown\", \"/bin/chown\", \"/usr/bin/chown\", \"/usr/local/bin/chown\"\n      )\n    )\n  ) and\n  process.args like~ (\n    \"kubernetes.default\",\n    \"kubernetes\",\n    \"*.svc\",\n    \"*.svc.cluster.local\",\n    \"*.cluster.local\"\n  )\n)\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1018","name":"Remote System Discovery","reference":"https://attack.mitre.org/techniques/T1018/"},{"id":"T1613","name":"Container and Resource Discovery","reference":"https://attack.mitre.org/techniques/T1613/"},{"id":"T1016","name":"System Network Configuration Discovery","reference":"https://attack.mitre.org/techniques/T1016/"},{"id":"T1049","name":"System Network Connections Discovery","reference":"https://attack.mitre.org/techniques/T1049/"}],"tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"}}]}}},"__N_SSG":true}