{"pageProps":{"rule":{"metadata":{"creation_date":"2026/01/21","integration":["cloud_defend"],"maturity":"production","min_stack_comments":"Defend for Containers integration was re-introduced in 9.3.0","min_stack_version":"9.3.0","updated_date":"2026/01/21"},"rule":{"author":["Elastic"],"description":"This rule detects the enumeration of tools by the \"which\" command inside a container. The \"which\" command is used to list\nwhat tools are installed on a system, and may be used by an adversary to gain information about the container and the services\nrunning inside it.\n","false_positives":["    There is a potential for false positives if the \"which\" command is used for legitimate purposes,\n    such as debugging or troubleshooting. It is important to investigate any alerts generated by this rule to determine\n    if they are indicative of malicious activity or part of legitimate container activity.\n    "],"from":"now-6m","index":["logs-cloud_defend.process*"],"interval":"5m","language":"eql","license":"Elastic License v2","name":"Tool Enumeration Detected via Defend for Containers","risk_score":21,"rule_id":"b84264aa-37a3-49f8-8bbc-60acbe9d4f86","severity":"low","tags":["Data Source: Elastic Defend for Containers","Domain: Container","OS: Linux","Use Case: Threat Detection","Tactic: Discovery","Language: eql"],"timestamp_override":"event.ingested","type":"eql","query":"process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and (\n  process.name == \"which\" or\n  (\n    /* Account for tools that execute utilities as a subprocess, in this case the target utility name will appear as a process arg */\n    process.name in (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\", \"busybox\") and\n    process.args in (\"which\", \"/bin/which\", \"/usr/bin/which\", \"/usr/local/bin/which\") and\n    /* default exclusion list to not FP on default multi-process commands */\n    not process.args in (\n      \"man\", \"/bin/man\", \"/usr/bin/man\", \"/usr/local/bin/man\",\n      \"chmod\", \"/bin/chmod\", \"/usr/bin/chmod\", \"/usr/local/bin/chmod\",\n      \"chown\", \"/bin/chown\", \"/usr/bin/chown\", \"/usr/local/bin/chown\"\n    )\n  )\n) and\nprocess.args in (\n\n  /* TCP IP */\n  \"curl\", \"wget\", \"socat\", \"nc\", \"netcat\", \"ncat\", \"busybox\", \"python3\", \"python\", \"perl\", \"node\", \"openssl\", \"ruby\", \"lua\",\n\n  /* networking */\n  \"getent\", \"dig\", \"nslookup\", \"host\", \"ip\", \"tcpdump\", \"tshark\",\n\n  /* container management */\n  \"kubectl\", \"docker\", \"kubelet\", \"kube-proxy\", \"containerd\", \"systemd\", \"crictl\",\n\n  /* compilation */\n  \"gcc\", \"g++\", \"clang\", \"clang++\", \"cc\", \"c++\", \"c99\", \"c89\", \"cc1*\", \"musl-gcc\", \"musl-clang\", \"tcc\", \"zig\", \"ccache\", \"distcc\", \"make\",\n\n  /* scanning */\n  \"nmap\", \"zenmap\", \"nuclei\", \"netdiscover\", \"legion\", \"masscan\", \"zmap\", \"zgrab\", \"ngrep\", \"telnet\", \"mitmproxy\", \"zmap\",\n  \"masscan\", \"zgrab\"\n) and\nprocess.interactive == true and container.id like \"*\"\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1518","name":"Software Discovery","reference":"https://attack.mitre.org/techniques/T1518/"},{"id":"T1613","name":"Container and Resource Discovery","reference":"https://attack.mitre.org/techniques/T1613/"}],"tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"}}]}}},"__N_SSG":true}