{"pageProps":{"rule":{"metadata":{"creation_date":"2026/01/21","integration":["cloud_defend"],"maturity":"production","min_stack_comments":"Defend for Containers integration was re-introduced in 9.3.0","min_stack_version":"9.3.0","updated_date":"2026/01/21"},"rule":{"author":["Elastic"],"description":"This rule detects the execution of the \"env\" or \"printenv\" commands inside a container. The \"env\" command is used\nto display all the environment variables for the current shell, and the \"printenv\" command is used to print the\nvalues of environment variables. These commands are used to enumerate the environment variables of the container,\nwhich can be used by an adversary to gain information about the container and the services running inside it.\n","false_positives":["    There is a potential for false positives if the \"env\" or \"printenv\" commands are used for legitimate purposes,\n    such as debugging or troubleshooting. It is important to investigate any alerts generated by this rule to determine\n    if they are indicative of malicious activity or part of legitimate container activity.\n    "],"from":"now-6m","index":["logs-cloud_defend.process*"],"interval":"5m","language":"eql","license":"Elastic License v2","name":"Environment Variable Enumeration Detected via Defend for Containers","risk_score":21,"rule_id":"f66a6869-d4c7-4d20-ab13-beefd03b63b4","severity":"low","tags":["Data Source: Elastic Defend for Containers","Domain: Container","OS: Linux","Use Case: Threat Detection","Tactic: Discovery","Language: eql"],"timestamp_override":"event.ingested","type":"eql","query":"process where host.os.type == \"linux\" and event.type == \"start\" and event.action == \"exec\" and (\n  process.name in (\"env\", \"printenv\") or\n  (\n    /* Account for tools that execute utilities as a subprocess, in this case the target utility name will appear as a process arg */\n    process.name in (\"bash\", \"dash\", \"sh\", \"tcsh\", \"csh\", \"zsh\", \"ksh\", \"fish\", \"busybox\") and\n    process.args in (\n      \"env\", \"/bin/env\", \"/usr/bin/env\", \"/usr/local/bin/env\",\n      \"printenv\", \"/bin/printenv\", \"/usr/bin/printenv\", \"/usr/local/bin/printenv\"\n    ) and\n    /* default exclusion list to not FP on default multi-process commands */\n    not process.args in (\n      \"which\", \"/bin/which\", \"/usr/bin/which\", \"/usr/local/bin/which\",\n      \"man\", \"/bin/man\", \"/usr/bin/man\", \"/usr/local/bin/man\",\n      \"chmod\", \"/bin/chmod\", \"/usr/bin/chmod\", \"/usr/local/bin/chmod\",\n      \"chown\", \"/bin/chown\", \"/usr/bin/chown\", \"/usr/local/bin/chown\"\n    )\n  )\n) and\nprocess.interactive == true and container.id like \"*\"\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1613","name":"Container and Resource Discovery","reference":"https://attack.mitre.org/techniques/T1613/"},{"id":"T1082","name":"System Information Discovery","reference":"https://attack.mitre.org/techniques/T1082/"}],"tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"}}]}}},"__N_SSG":true}