{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunt identifies base64 encoded powershell commands in process start events and filters ones with suspicious keywords like downloaders and evasion related commands.\n","integration":["endpoint","windows","system"],"uuid":"2e583d3c-7ad6-4544-a0db-c685b2066493","name":"Suspicious Base64 Encoded Powershell Command","language":["ES|QL"],"license":"Elastic License v2","notes":["This hunt can be expanded to include more evasion techniques and downloaders.","Pivoting by `agent.id` can provide more context on the affected hosts."],"mitre":["T1059","T1059.001","T1027","T1027.010"],"query":["from logs-endpoint.events.process-*, logs-windows.sysmon_operational-*, logs-system.security-*\n| where host.os.type == \"windows\" and event.category == \"process\" and event.type == \"start\" and TO_LOWER(process.name) == \"powershell.exe\" and process.command_line rlike \".+ -(e|E).*\"\n| keep agent.id, process.command_line\n /* simplified regex to extract base64 encoded blob */\n| grok process.command_line \"\"\"(?<base64_data>([A-Za-z0-9+/]+={1,2}$|[A-Za-z0-9+/]{100,}))\"\"\"\n| where base64_data is not null\n /* base64 decode added in 8.14 */\n| eval decoded_base64_cmdline = replace(TO_LOWER(FROM_BASE64(base64_data)), \"\"\"\\u0000\"\"\", \"\")\n /* most common suspicious keywords, you can add more patterns here */\n| where decoded_base64_cmdline rlike \"\"\".*(http|webclient|download|mppreference|sockets|bxor|.replace|reflection|assembly|load|bits|start-proc|iwr|frombase64).*\"\"\"\n| keep agent.id, process.command_line, decoded_base64_cmdline\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-endpoint.events.process-*, logs-windows.sysmon_operational-*, logs-system.security-*\n| where host.os.type == \"windows\" and event.category == \"process\" and event.type == \"start\" and TO_LOWER(process.name) == \"powershell.exe\" and process.command_line rlike \".+ -(e|E).*\"\n| keep agent.id, process.command_line\n /* simplified regex to extract base64 encoded blob */\n| grok process.command_line \"\"\"(?<base64_data>([A-Za-z0-9+/]+={1,2}$|[A-Za-z0-9+/]{100,}))\"\"\"\n| where base64_data is not null\n /* base64 decode added in 8.14 */\n| eval decoded_base64_cmdline = replace(TO_LOWER(FROM_BASE64(base64_data)), \"\"\"\\u0000\"\"\", \"\")\n /* most common suspicious keywords, you can add more patterns here */\n| where decoded_base64_cmdline rlike \"\"\".*(http|webclient|download|mppreference|sockets|bxor|.replace|reflection|assembly|load|bits|start-proc|iwr|frombase64).*\"\"\"\n| keep agent.id, process.command_line, decoded_base64_cmdline\n"],"license":"Elastic License v2","description":"This hunt identifies base64 encoded powershell commands in process start events and filters ones with suspicious keywords like downloaders and evasion related commands.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1059","name":"","reference":"https://attack.mitre.org/techniques/T1059/"},{"id":"T1059","name":"","reference":"https://attack.mitre.org/techniques/T1059/","subtechnique":[{"id":"T1059.001","reference":"https://attack.mitre.org/techniques/T1059/001/"}]},{"id":"T1027","name":"","reference":"https://attack.mitre.org/techniques/T1027/"},{"id":"T1027","name":"","reference":"https://attack.mitre.org/techniques/T1027/","subtechnique":[{"id":"T1027.010","reference":"https://attack.mitre.org/techniques/T1027/010/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["endpoint","windows","system"]}}},"__N_SSG":true}