{"pageProps":{"rule":{"metadata":{"creation_date":"2020/12/22","integration":["endpoint"],"maturity":"production","updated_date":"2024/05/21"},"rule":{"author":["Elastic"],"description":"The Secure Shell (SSH) authorized_keys file specifies which users are allowed to log into a server using public key\nauthentication. Adversaries may modify it to maintain persistence on a victim host by adding their own public key(s).\n","from":"now-9m","index":["auditbeat-*","logs-endpoint.events.*"],"language":"kuery","license":"Elastic License v2","name":"SSH Authorized Keys File Modification","risk_score":47,"rule_id":"2215b8bd-1759-4ffa-8ab8-55c8e6b32e7f","severity":"medium","tags":["Domain: Endpoint","OS: Linux","OS: macOS","Use Case: Threat Detection","Tactic: Lateral Movement","Tactic: Persistence","Data Source: Elastic Defend"],"timestamp_override":"event.ingested","type":"new_terms","query":"event.category:file and event.type:(change or creation) and\n file.name:(\"authorized_keys\" or \"authorized_keys2\" or \"/etc/ssh/sshd_config\" or \"/root/.ssh\") and\n not process.executable:\n             (/Library/Developer/CommandLineTools/usr/bin/git or\n              /usr/local/Cellar/maven/*/libexec/bin/mvn or\n              /Library/Java/JavaVirtualMachines/jdk*.jdk/Contents/Home/bin/java or\n              /usr/bin/vim or\n              /usr/local/Cellar/coreutils/*/bin/gcat or\n              /usr/bin/bsdtar or\n              /usr/bin/nautilus or\n              /usr/bin/scp or\n              /usr/bin/touch or\n              /var/lib/docker/* or\n              /usr/bin/google_guest_agent or \n              /opt/jc/bin/jumpcloud-agent or \n              /opt/puppetlabs/puppet/bin/puppet or\n              /usr/bin/chef-client\n)\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1098","name":"Account Manipulation","reference":"https://attack.mitre.org/techniques/T1098/","subtechnique":[{"id":"T1098.004","name":"SSH Authorized Keys","reference":"https://attack.mitre.org/techniques/T1098/004/"}]}],"tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"}},{"framework":"MITRE ATT&CK","technique":[{"id":"T1021","name":"Remote Services","reference":"https://attack.mitre.org/techniques/T1021/","subtechnique":[{"id":"T1021.004","name":"SSH","reference":"https://attack.mitre.org/techniques/T1021/004/"}]},{"id":"T1563","name":"Remote Service Session Hijacking","reference":"https://attack.mitre.org/techniques/T1563/","subtechnique":[{"id":"T1563.001","name":"SSH Hijacking","reference":"https://attack.mitre.org/techniques/T1563/001/"}]}],"tactic":{"id":"TA0008","name":"Lateral Movement","reference":"https://attack.mitre.org/tactics/TA0008/"}}],"new_terms":{"field":"new_terms_fields","value":["host.id","process.executable"],"history_window_start":[{"field":"history_window_start","value":"now-10d"}]}}}},"__N_SSG":true}