{"pageProps":{"rule":{"metadata":{"creation_date":"2021/01/11","integration":["endpoint"],"maturity":"production","min_stack_comments":"New fields added: required_fields, related_integrations, setup","min_stack_version":"8.3.0","updated_date":"2023/06/22"},"rule":{"author":["Elastic"],"description":"Identifies the execution of a suspicious child process of the Event Monitor Daemon (emond). Adversaries may abuse this\nservice by writing a rule to execute commands when a defined event occurs, such as system start up or user\nauthentication.\n","from":"now-9m","index":["logs-endpoint.events.*"],"language":"eql","license":"Elastic License v2","name":"Suspicious Emond Child Process","references":["https://www.xorrior.com/emond-persistence/"],"risk_score":47,"rule_id":"3e3d15c6-1509-479a-b125-21718372157e","severity":"medium","tags":["Domain: Endpoint","OS: macOS","Use Case: Threat Detection","Tactic: Persistence"],"timestamp_override":"event.ingested","type":"eql","query":"process where host.os.type == \"macos\" and event.type in (\"start\", \"process_started\") and\n process.parent.name : \"emond\" and\n process.name : (\n   \"bash\",\n   \"dash\",\n   \"sh\",\n   \"tcsh\",\n   \"csh\",\n   \"zsh\",\n   \"ksh\",\n   \"fish\",\n   \"Python\",\n   \"python*\",\n   \"perl*\",\n   \"php*\",\n   \"osascript\",\n   \"pwsh\",\n   \"curl\",\n   \"wget\",\n   \"cp\",\n   \"mv\",\n   \"touch\",\n   \"echo\",\n   \"base64\",\n   \"launchctl\")\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1546","name":"Event Triggered Execution","reference":"https://attack.mitre.org/techniques/T1546/","subtechnique":[{"id":"T1546.014","name":"Emond","reference":"https://attack.mitre.org/techniques/T1546/014/"}]}],"tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"}}]}}},"__N_SSG":true}