{"pageProps":{"rule":{"metadata":{"creation_date":"2026/01/30","integration":["endpoint"],"maturity":"production","updated_date":"2026/01/30"},"rule":{"author":["Elastic"],"description":"Detects when a DNS request is made for an IP lookup service to determine the external IP address of the \nsystem via an unsigned or untrusted binary. This is commonly used by malware for reconnaissance before \nestablishing C2 connections.\n","from":"now-9m","index":["logs-endpoint.events.network-*"],"language":"eql","license":"Elastic License v2","name":"DNS Request for IP Lookup Service via Unsigned Binary","risk_score":47,"rule_id":"47e46d85-3963-44a0-b856-bccff48f8676","severity":"medium","tags":["Domain: Endpoint","OS: macOS","Use Case: Threat Detection","Tactic: Discovery","Data Source: Elastic Defend","Language: eql"],"timestamp_override":"event.ingested","type":"eql","query":"dns where host.os.type == \"macos\" and event.action == \"lookup_result\" and \n  (process.code_signature.trusted == false or process.code_signature.exists == false) and\n  dns.question.name like~ (\"*ip-api.com*\", \"*ipwho.is*\", \"*checkip.dyndns.org*\", \"*api.ipify.org*\",\n                           \"*api.npoint.io*\", \"*whatismyip.akamai.com*\", \"*bot.whatismyipaddress.com*\",\n                           \"*ifcfg.me*\", \"*ifconfig.me*\", \"*ident.me*\", \"*ipof.in*\", \"*ip.tyk.nu*\",\n                           \"*ipwhois.app*\", \"*freeipapi.com*\", \"*icanhazip.com*\", \"*curlmyip.com*\",\n                           \"*wgetip.com*\", \"*eth0.me*\", \"*ipecho.net*\", \"*ip.appspot.com*\",\n                           \"*api.myip.com*\", \"*geoiptool.com*\", \"*api.2ip.ua*\", \"*api.ip.sb*\",\n                           \"*ipinfo.io*\", \"*checkip.amazonaws.com*\", \"*wtfismyip.com*\", \"*iplogger.*\",\n                           \"*freegeoip.net*\", \"*freegeoip.app*\", \"*myip.ipip.net*\", \"*geoplugin.net*\",\n                           \"*myip.dnsomatic.com*\", \"*www.geoplugin.net*\", \"*api64.ipify.org*\",\n                           \"*ip4.seeip.org*\", \"*.geojs.io*\", \"*portmap.io*\", \"*api.db-ip.com*\",\n                           \"*geolocation-db.com*\", \"*inet-ip.info*\", \"*httpbin.org*\", \"*myip.opendns.com*\") and\n  not process.executable like \"/Users/*/Library/Developer/CoreSimulator/*\"\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"name":"Discovery","id":"TA0007","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"name":"System Network Configuration Discovery","id":"T1016","reference":"https://attack.mitre.org/techniques/T1016/","subtechnique":[{"name":"Internet Connection Discovery","id":"T1016.001","reference":"https://attack.mitre.org/techniques/T1016/001/"}]}]}]}}},"__N_SSG":true}