{"pageProps":{"rule":{"metadata":{"creation_date":"2024/09/06","integration":["windows","system","sentinel_one_cloud_funnel","m365_defender"],"maturity":"production","updated_date":"2024/09/06"},"rule":{"author":["Elastic"],"description":"Identifies the execution of PowerShell with suspicious argument values. This behavior is often observed during malware\ninstallation leveraging PowerShell.\n","from":"now-9m","index":["winlogbeat-*","logs-windows.*","logs-system.security*","logs-windows.sysmon_operational-*","logs-sentinel_one_cloud_funnel.*","logs-m365_defender.event-*"],"language":"eql","license":"Elastic License v2","name":"Suspicious Windows Powershell Arguments","risk_score":73,"rule_id":"83bf249e-4348-47ba-9741-1202a09556ad","severity":"high","tags":["Domain: Endpoint","OS: Windows","Use Case: Threat Detection","Tactic: Execution","Data Source: System","Data Source: Sysmon","Data Source: SentinelOne","Data Source: Microsoft Defender for Endpoint"],"timestamp_override":"event.ingested","type":"eql","query":"process where host.os.type == \"windows\" and event.type == \"start\" and\n process.name : \"powershell.exe\" and \n  (\n   process.command_line :\n        (\n          \"*^*^*^*^*^*^*^*^*^*\",\n          \"*`*`*`*`*\",\n          \"*+*+*+*+*+*+*\",\n          \"*[char[]](*)*-join*\",\n          \"*Base64String*\",\n          \"*[*Convert]*\",\n          \"*.Compression.*\",\n          \"*-join($*\",\n          \"*.replace*\",\n          \"*MemoryStream*\",\n          \"*WriteAllBytes*\",\n          \"* -enc *\",\n          \"* -ec *\",\n          \"* /e *\",\n          \"* /enc *\",\n          \"* /ec *\",\n          \"*WebClient*\",\n          \"*DownloadFile*\",\n          \"*DownloadString*\",\n          \"* iex*\",\n          \"* iwr*\",\n          \"*Reflection.Assembly*\",\n          \"*Assembly.GetType*\",\n          \"*$env:temp\\\\*start*\",\n          \"*powercat*\",\n          \"*nslookup -q=txt*\",\n          \"*$host.UI.PromptForCredential*\",\n          \"*Net.Sockets.TCPClient*\",\n          \"*curl *;Start*\",\n          \"powershell.exe \\\"<#*\",\n          \"*ssh -p *\",\n          \"*http*|iex*\",\n          \"*@SSL\\\\DavWWWRoot\\\\*.ps1*\",\n          \"*.lnk*.Seek(0x*\",\n          \"*[string]::join(*\",\n          \"*[Array]::Reverse($*\",\n          \"* hidden $(gc *\",\n          \"*=wscri& set*\",\n          \"*http'+'s://*\",\n          \"*.content|i''Ex*\",\n          \"*//:sptth*\",\n          \"*//:ptth*\",\n          \"*$*=Get-Content*AppData*.SubString(*$*\",\n          \"*=cat *AppData*.substring(*);*$*\"\n        ) or\n\n      (process.args : \"-c\" and process.args : \"&{'*\") or\n\n      (process.args : \"-Outfile\" and process.args : \"Start*\") or\n\n      (process.args : \"-bxor\" and process.args : \"0x*\") or\n\n      process.args : \"$*$*;set-alias\" or\n\n      (process.parent.name : (\"explorer.exe\", \"cmd.exe\") and \n       process.command_line : (\"*-encodedCommand*\", \"*Invoke-webrequest*\", \"*WebClient*\", \"*Reflection.Assembly*\"))\n  )\n","threat":[{"framework":"MITRE ATT&CK","technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059/","subtechnique":[{"id":"T1059.001","name":"PowerShell","reference":"https://attack.mitre.org/techniques/T1059/001/"}]}],"tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"}}]}}},"__N_SSG":true}