{"pageProps":{"rule":{"hunt":{"author":"Elastic","description":"This hunt identifies potential system binary hijacking attempts on Linux systems. It monitors process execution events where common system binaries such as ls, cat, mkdir, touch, mv, and cp are the parent processes. These activities can indicate attempts to hijack system binaries for malicious purposes. The hunt lists detailed information for further analysis and investigation.\n","integration":["endpoint"],"uuid":"d22cbe8f-c84d-4811-aa6d-f1ee00c806b2","name":"Unusual System Binary Parent (Potential System Binary Hijacking Attempt)","language":["ES|QL"],"license":"Elastic License v2","notes":["Monitors process execution events where common system binaries such as ls, cat, mkdir, touch, mv, and cp are the parent processes.","Focuses on identifying unusual or suspicious child processes spawned by these common system binaries.","Uses stats to count occurrences and identify unusual activity by looking at the number of unique hosts and processes involved.","Requires additional data analysis and investigation into results to identify malicious or unauthorized use of system binaries."],"mitre":["T1546.004","T1059.004"],"query":["from logs-endpoint.events.process-*\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.action == \"exec\" and event.type == \"start\" and process.parent.name in (\"ls\", \"cat\", \"mkdir\", \"touch\", \"mv\", \"cp\")\n| stats cc = count(), host_count = count_distinct(host.name) by process.parent.executable, process.executable\n| where host_count <= 5\n| sort cc asc\n| limit 100\n"]},"rule":{"tags":["Hunt Type: Hunt"],"query":["from logs-endpoint.events.process-*\n| where @timestamp > now() - 30 day\n| where host.os.type == \"linux\" and event.action == \"exec\" and event.type == \"start\" and process.parent.name in (\"ls\", \"cat\", \"mkdir\", \"touch\", \"mv\", \"cp\")\n| stats cc = count(), host_count = count_distinct(host.name) by process.parent.executable, process.executable\n| where host_count <= 5\n| sort cc asc\n| limit 100\n"],"license":"Elastic License v2","description":"This hunt identifies potential system binary hijacking attempts on Linux systems. It monitors process execution events where common system binaries such as ls, cat, mkdir, touch, mv, and cp are the parent processes. These activities can indicate attempts to hijack system binaries for malicious purposes. The hunt lists detailed information for further analysis and investigation.\n","threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"","name":"","reference":""},"technique":[{"id":"T1546","name":"","reference":"https://attack.mitre.org/techniques/T1546/","subtechnique":[{"id":"T1546.004","reference":"https://attack.mitre.org/techniques/T1546/004/"}]},{"id":"T1059","name":"","reference":"https://attack.mitre.org/techniques/T1059/","subtechnique":[{"id":"T1059.004","reference":"https://attack.mitre.org/techniques/T1059/004/"}]}]}]},"metadata":{"creation_date":"1970-01-01T00:00:00.000Z","updated_date":"1970-01-01T00:00:00.000Z","integration":["endpoint"]}}},"__N_SSG":true}